{
  "vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "<SEP>": 4,
    "▁": 5,
    "h": 6,
    "a": 7,
    "l": 8,
    "o": 9,
    "d": 10,
    "y": 11,
    "n": 12,
    "g": 13,
    "b": 14,
    "i": 15,
    "s": 16,
    "t": 17,
    "u": 18,
    "e": 19,
    "r": 20,
    "m": 21,
    "j": 22,
    "p": 23,
    "k": 24,
    "f": 25,
    "c": 26,
    "w": 27,
    "v": 28,
    "an": 29,
    "▁s": 30,
    "▁b": 31,
    "ya": 32,
    "▁k": 33,
    "am": 34,
    "er": 35,
    "▁a": 36,
    "en": 37,
    "▁m": 38,
    "pa": 39,
    "ang": 40,
    "da": 41,
    "▁t": 42,
    "▁sa": 43,
    "ar": 44,
    "▁saya": 45,
    "at": 46,
    "la": 47,
    "tu": 48,
    "em": 49,
    "▁d": 50,
    "in": 51,
    "▁p": 52,
    "amu": 53,
    "▁kamu": 54,
    "▁h": 55,
    "sa": 56,
    "▁bi": 57,
    "▁apa": 58,
    "ga": 59,
    "▁se": 60,
    "ia": 61,
    "▁bisa": 62,
    "▁ba": 63,
    "▁c": 64,
    "▁ada": 65,
    "▁men": 66,
    "▁y": 67,
    "▁yang": 68,
    "▁ber": 69,
    "antu": 70,
    "al": 71,
    "im": 72,
    "▁ter": 73,
    "lah": 74,
    "ih": 75,
    "enang": 76,
    "▁j": 77,
    "as": 78,
    "kan": 79,
    "▁ti": 80,
    "▁n": 81,
    "▁sam": 82,
    "▁adalah": 83,
    "emb": 84,
    "lu": 85,
    "ik": 86,
    "ro": 87,
    "▁sem": 88,
    "▁da": 89,
    "un": 90,
    "anya": 91,
    "ta": 92,
    "▁memb": 93,
    "asih": 94,
    "gi": 95,
    "uat": 96,
    "▁ak": 97,
    "ri": 98,
    "▁per": 99,
    "▁ma": 100,
    "▁tida": 101,
    "▁tidak": 102,
    "▁senang": 103,
    "▁la": 104,
    "ima": 105,
    "▁sia": 106,
    "▁l": 107,
    "on": 108,
    "ena": 109,
    "ah": 110,
    "▁kasih": 111,
    "▁i": 112,
    "▁membantu": 113,
    "▁sama": 114,
    "▁ke": 115,
    "ing": 116,
    "us": 117,
    "▁semo": 118,
    "▁semoga": 119,
    "eng": 120,
    "ab": 121,
    "▁terima": 122,
    "or": 123,
    "hat": 124,
    "ot": 125,
    "▁akh": 126,
    "▁akhya": 127,
    "▁akhyar": 128,
    "▁di": 129,
    "▁har": 130,
    "ti": 131,
    "es": 132,
    "ua": 133,
    "▁bantu": 134,
    "▁baik": 135,
    "tanya": 136,
    "▁itu": 137,
    "▁meng": 138,
    "rog": 139,
    "rogr": 140,
    "rogram": 141,
    "▁in": 142,
    "▁siapa": 143,
    "▁dari": 144,
    "▁dan": 145,
    "▁ya": 146,
    "▁lagi": 147,
    "ela": 148,
    "arn": 149,
    "▁su": 150,
    "▁pa": 151,
    "ob": 152,
    "ja": 153,
    "ha": 154,
    "▁deng": 155,
    "▁dengan": 156,
    "mu": 157,
    "ur": 158,
    "▁chat": 159,
    "▁chatb": 160,
    "▁chatbot": 161,
    "▁ne": 162,
    "▁le": 163,
    "ka": 164,
    "▁kar": 165,
    "▁karena": 166,
    "▁ju": 167,
    "dah": 168,
    "▁sel": 169,
    "▁selam": 170,
    "▁selamat": 171,
    "imu": 172,
    "▁dib": 173,
    "ol": 174,
    "▁menja": 175,
    "▁pertanya": 176,
    "▁pertanyaan": 177,
    "▁program": 178,
    "elaj": 179,
    "elajar": 180,
    "▁hal": 181,
    "emu": 182,
    "▁buat": 183,
    "int": 184,
    "▁menjaw": 185,
    "▁menjawab": 186,
    "pu": 187,
    "▁sampa": 188,
    "▁sampai": 189,
    "▁programm": 190,
    "▁bu": 191,
    "▁baha": 192,
    "▁bag": 193,
    "▁belajar": 194,
    "▁halo": 195,
    "▁ha": 196,
    "▁harimu": 197,
    "▁meny": 198,
    "▁buatan": 199,
    "▁pint": 200,
    "▁pintar": 201,
    "▁ini": 202,
    "ita": 203,
    "▁mengob": 204,
    "▁mengobro": 205,
    "▁mengobrol": 206,
    "▁suka": 207,
    "yt": 208,
    "▁ai": 209,
    "▁bagus": 210,
    "▁hai": 211,
    "temu": 212,
    "el": 213,
    "▁kab": 214,
    "▁kabar": 215,
    "cri": 216,
    "crip": 217,
    "cript": 218,
    "▁ja": 219,
    "▁sed": 220,
    "▁un": 221,
    "▁untu": 222,
    "▁untuk": 223,
    "ung": 224,
    "ali": 225,
    "▁kena": 226,
    "▁kenapa": 227,
    "lalu": 228,
    "▁cua": 229,
    "▁cuac": 230,
    "▁cuaca": 231,
    "▁hari": 232,
    "▁hi": 233,
    "▁juga": 234,
    "▁menyenang": 235,
    "▁menyenangkan": 236,
    "du": 237,
    "▁dibuat": 238,
    "▁nam": 239,
    "▁nama": 240,
    "wor": 241,
    "erita": 242,
    "▁jang": 243,
    "▁jangan": 244,
    "▁ko": 245,
    "▁lu": 246,
    "▁bahasa": 247,
    "▁pyt": 248,
    "▁pyth": 249,
    "▁python": 250,
    "▁siap": 251,
    "angat": 252,
    "▁sek": 253,
    "sti": 254,
    "ek": 255,
    "▁learn": 256,
    "▁learning": 257,
    "▁maa": 258,
    "▁maaf": 259,
    "▁bera": 260,
    "▁berapa": 261,
    "▁mat": 262,
    "▁dua": 263,
    "▁denganmu": 264,
    "▁mal": 265,
    "▁malam": 266,
    "▁ol": 267,
    "▁ole": 268,
    "▁oleh": 269,
    "▁bot": 270,
    "▁neur": 271,
    "▁neural": 272,
    "▁net": 273,
    "▁networ": 274,
    "▁network": 275,
    "▁ty": 276,
    "▁typ": 277,
    "▁types": 278,
    "▁typescript": 279,
    "▁cerita": 280,
    "▁banya": 281,
    "▁banyak": 282,
    "▁du": 283,
    "▁dulu": 284,
    "it": 285,
    "per": 286,
    "ter": 287,
    "ong": 288,
    "arnya": 289,
    "▁semangat": 290,
    "ir": 291,
    "ap": 292,
    "ara": 293,
    "▁programming": 294,
    "▁mu": 295,
    "▁pun": 296,
    "▁punya": 297,
    "▁matah": 298,
    "▁matahar": 299
  },
  "merges": [
    [
      "a",
      "n"
    ],
    [
      "▁",
      "s"
    ],
    [
      "▁",
      "b"
    ],
    [
      "y",
      "a"
    ],
    [
      "▁",
      "k"
    ],
    [
      "a",
      "m"
    ],
    [
      "e",
      "r"
    ],
    [
      "▁",
      "a"
    ],
    [
      "e",
      "n"
    ],
    [
      "▁",
      "m"
    ],
    [
      "p",
      "a"
    ],
    [
      "an",
      "g"
    ],
    [
      "d",
      "a"
    ],
    [
      "▁",
      "t"
    ],
    [
      "▁s",
      "a"
    ],
    [
      "a",
      "r"
    ],
    [
      "▁sa",
      "ya"
    ],
    [
      "a",
      "t"
    ],
    [
      "l",
      "a"
    ],
    [
      "t",
      "u"
    ],
    [
      "e",
      "m"
    ],
    [
      "▁",
      "d"
    ],
    [
      "i",
      "n"
    ],
    [
      "▁",
      "p"
    ],
    [
      "am",
      "u"
    ],
    [
      "▁k",
      "amu"
    ],
    [
      "▁",
      "h"
    ],
    [
      "s",
      "a"
    ],
    [
      "▁b",
      "i"
    ],
    [
      "▁a",
      "pa"
    ],
    [
      "g",
      "a"
    ],
    [
      "▁s",
      "e"
    ],
    [
      "i",
      "a"
    ],
    [
      "▁bi",
      "sa"
    ],
    [
      "▁b",
      "a"
    ],
    [
      "▁",
      "c"
    ],
    [
      "▁a",
      "da"
    ],
    [
      "▁m",
      "en"
    ],
    [
      "▁",
      "y"
    ],
    [
      "▁y",
      "ang"
    ],
    [
      "▁b",
      "er"
    ],
    [
      "an",
      "tu"
    ],
    [
      "a",
      "l"
    ],
    [
      "i",
      "m"
    ],
    [
      "▁t",
      "er"
    ],
    [
      "la",
      "h"
    ],
    [
      "i",
      "h"
    ],
    [
      "en",
      "ang"
    ],
    [
      "▁",
      "j"
    ],
    [
      "a",
      "s"
    ],
    [
      "k",
      "an"
    ],
    [
      "▁t",
      "i"
    ],
    [
      "▁",
      "n"
    ],
    [
      "▁s",
      "am"
    ],
    [
      "▁ada",
      "lah"
    ],
    [
      "em",
      "b"
    ],
    [
      "l",
      "u"
    ],
    [
      "i",
      "k"
    ],
    [
      "r",
      "o"
    ],
    [
      "▁s",
      "em"
    ],
    [
      "▁",
      "da"
    ],
    [
      "u",
      "n"
    ],
    [
      "an",
      "ya"
    ],
    [
      "t",
      "a"
    ],
    [
      "▁m",
      "emb"
    ],
    [
      "as",
      "ih"
    ],
    [
      "g",
      "i"
    ],
    [
      "u",
      "at"
    ],
    [
      "▁a",
      "k"
    ],
    [
      "r",
      "i"
    ],
    [
      "▁p",
      "er"
    ],
    [
      "▁m",
      "a"
    ],
    [
      "▁ti",
      "da"
    ],
    [
      "▁tida",
      "k"
    ],
    [
      "▁s",
      "enang"
    ],
    [
      "▁",
      "la"
    ],
    [
      "im",
      "a"
    ],
    [
      "▁s",
      "ia"
    ],
    [
      "▁",
      "l"
    ],
    [
      "o",
      "n"
    ],
    [
      "en",
      "a"
    ],
    [
      "a",
      "h"
    ],
    [
      "▁k",
      "asih"
    ],
    [
      "▁",
      "i"
    ],
    [
      "▁memb",
      "antu"
    ],
    [
      "▁sam",
      "a"
    ],
    [
      "▁k",
      "e"
    ],
    [
      "in",
      "g"
    ],
    [
      "u",
      "s"
    ],
    [
      "▁sem",
      "o"
    ],
    [
      "▁semo",
      "ga"
    ],
    [
      "en",
      "g"
    ],
    [
      "a",
      "b"
    ],
    [
      "▁ter",
      "ima"
    ],
    [
      "o",
      "r"
    ],
    [
      "h",
      "at"
    ],
    [
      "o",
      "t"
    ],
    [
      "▁ak",
      "h"
    ],
    [
      "▁akh",
      "ya"
    ],
    [
      "▁akhya",
      "r"
    ],
    [
      "▁d",
      "i"
    ],
    [
      "▁h",
      "ar"
    ],
    [
      "t",
      "i"
    ],
    [
      "e",
      "s"
    ],
    [
      "u",
      "a"
    ],
    [
      "▁b",
      "antu"
    ],
    [
      "▁ba",
      "ik"
    ],
    [
      "t",
      "anya"
    ],
    [
      "▁i",
      "tu"
    ],
    [
      "▁men",
      "g"
    ],
    [
      "ro",
      "g"
    ],
    [
      "rog",
      "r"
    ],
    [
      "rogr",
      "am"
    ],
    [
      "▁",
      "in"
    ],
    [
      "▁sia",
      "pa"
    ],
    [
      "▁da",
      "ri"
    ],
    [
      "▁d",
      "an"
    ],
    [
      "▁",
      "ya"
    ],
    [
      "▁la",
      "gi"
    ],
    [
      "e",
      "la"
    ],
    [
      "ar",
      "n"
    ],
    [
      "▁s",
      "u"
    ],
    [
      "▁",
      "pa"
    ],
    [
      "o",
      "b"
    ],
    [
      "j",
      "a"
    ],
    [
      "h",
      "a"
    ],
    [
      "▁d",
      "eng"
    ],
    [
      "▁deng",
      "an"
    ],
    [
      "m",
      "u"
    ],
    [
      "u",
      "r"
    ],
    [
      "▁c",
      "hat"
    ],
    [
      "▁chat",
      "b"
    ],
    [
      "▁chatb",
      "ot"
    ],
    [
      "▁n",
      "e"
    ],
    [
      "▁l",
      "e"
    ],
    [
      "k",
      "a"
    ],
    [
      "▁k",
      "ar"
    ],
    [
      "▁kar",
      "ena"
    ],
    [
      "▁j",
      "u"
    ],
    [
      "da",
      "h"
    ],
    [
      "▁se",
      "l"
    ],
    [
      "▁sel",
      "am"
    ],
    [
      "▁selam",
      "at"
    ],
    [
      "im",
      "u"
    ],
    [
      "▁di",
      "b"
    ],
    [
      "o",
      "l"
    ],
    [
      "▁men",
      "ja"
    ],
    [
      "▁per",
      "tanya"
    ],
    [
      "▁pertanya",
      "an"
    ],
    [
      "▁p",
      "rogram"
    ],
    [
      "ela",
      "j"
    ],
    [
      "elaj",
      "ar"
    ],
    [
      "▁h",
      "al"
    ],
    [
      "em",
      "u"
    ],
    [
      "▁b",
      "uat"
    ],
    [
      "in",
      "t"
    ],
    [
      "▁menja",
      "w"
    ],
    [
      "▁menjaw",
      "ab"
    ],
    [
      "p",
      "u"
    ],
    [
      "▁sam",
      "pa"
    ],
    [
      "▁sampa",
      "i"
    ],
    [
      "▁program",
      "m"
    ],
    [
      "▁b",
      "u"
    ],
    [
      "▁ba",
      "ha"
    ],
    [
      "▁ba",
      "g"
    ],
    [
      "▁b",
      "elajar"
    ],
    [
      "▁hal",
      "o"
    ],
    [
      "▁h",
      "a"
    ],
    [
      "▁har",
      "imu"
    ],
    [
      "▁men",
      "y"
    ],
    [
      "▁buat",
      "an"
    ],
    [
      "▁p",
      "int"
    ],
    [
      "▁pint",
      "ar"
    ],
    [
      "▁in",
      "i"
    ],
    [
      "i",
      "ta"
    ],
    [
      "▁meng",
      "ob"
    ],
    [
      "▁mengob",
      "ro"
    ],
    [
      "▁mengobro",
      "l"
    ],
    [
      "▁su",
      "ka"
    ],
    [
      "y",
      "t"
    ],
    [
      "▁a",
      "i"
    ],
    [
      "▁bag",
      "us"
    ],
    [
      "▁ha",
      "i"
    ],
    [
      "t",
      "emu"
    ],
    [
      "e",
      "l"
    ],
    [
      "▁k",
      "ab"
    ],
    [
      "▁kab",
      "ar"
    ],
    [
      "c",
      "ri"
    ],
    [
      "cri",
      "p"
    ],
    [
      "crip",
      "t"
    ],
    [
      "▁j",
      "a"
    ],
    [
      "▁se",
      "d"
    ],
    [
      "▁",
      "un"
    ],
    [
      "▁un",
      "tu"
    ],
    [
      "▁untu",
      "k"
    ],
    [
      "un",
      "g"
    ],
    [
      "al",
      "i"
    ],
    [
      "▁k",
      "ena"
    ],
    [
      "▁kena",
      "pa"
    ],
    [
      "la",
      "lu"
    ],
    [
      "▁c",
      "ua"
    ],
    [
      "▁cua",
      "c"
    ],
    [
      "▁cuac",
      "a"
    ],
    [
      "▁har",
      "i"
    ],
    [
      "▁h",
      "i"
    ],
    [
      "▁ju",
      "ga"
    ],
    [
      "▁meny",
      "enang"
    ],
    [
      "▁menyenang",
      "kan"
    ],
    [
      "d",
      "u"
    ],
    [
      "▁dib",
      "uat"
    ],
    [
      "▁n",
      "am"
    ],
    [
      "▁nam",
      "a"
    ],
    [
      "w",
      "or"
    ],
    [
      "er",
      "ita"
    ],
    [
      "▁j",
      "ang"
    ],
    [
      "▁jang",
      "an"
    ],
    [
      "▁k",
      "o"
    ],
    [
      "▁",
      "lu"
    ],
    [
      "▁baha",
      "sa"
    ],
    [
      "▁p",
      "yt"
    ],
    [
      "▁pyt",
      "h"
    ],
    [
      "▁pyth",
      "on"
    ],
    [
      "▁sia",
      "p"
    ],
    [
      "ang",
      "at"
    ],
    [
      "▁se",
      "k"
    ],
    [
      "s",
      "ti"
    ],
    [
      "e",
      "k"
    ],
    [
      "▁le",
      "arn"
    ],
    [
      "▁learn",
      "ing"
    ],
    [
      "▁ma",
      "a"
    ],
    [
      "▁maa",
      "f"
    ],
    [
      "▁ber",
      "a"
    ],
    [
      "▁bera",
      "pa"
    ],
    [
      "▁m",
      "at"
    ],
    [
      "▁d",
      "ua"
    ],
    [
      "▁dengan",
      "mu"
    ],
    [
      "▁m",
      "al"
    ],
    [
      "▁mal",
      "am"
    ],
    [
      "▁",
      "ol"
    ],
    [
      "▁ol",
      "e"
    ],
    [
      "▁ole",
      "h"
    ],
    [
      "▁b",
      "ot"
    ],
    [
      "▁ne",
      "ur"
    ],
    [
      "▁neur",
      "al"
    ],
    [
      "▁ne",
      "t"
    ],
    [
      "▁net",
      "wor"
    ],
    [
      "▁networ",
      "k"
    ],
    [
      "▁t",
      "y"
    ],
    [
      "▁ty",
      "p"
    ],
    [
      "▁typ",
      "es"
    ],
    [
      "▁types",
      "cript"
    ],
    [
      "▁c",
      "erita"
    ],
    [
      "▁b",
      "anya"
    ],
    [
      "▁banya",
      "k"
    ],
    [
      "▁d",
      "u"
    ],
    [
      "▁du",
      "lu"
    ],
    [
      "i",
      "t"
    ],
    [
      "p",
      "er"
    ],
    [
      "t",
      "er"
    ],
    [
      "on",
      "g"
    ],
    [
      "arn",
      "ya"
    ],
    [
      "▁sem",
      "angat"
    ],
    [
      "i",
      "r"
    ],
    [
      "a",
      "p"
    ],
    [
      "ar",
      "a"
    ],
    [
      "▁programm",
      "ing"
    ],
    [
      "▁m",
      "u"
    ],
    [
      "▁p",
      "un"
    ],
    [
      "▁pun",
      "ya"
    ],
    [
      "▁mat",
      "ah"
    ],
    [
      "▁matah",
      "ar"
    ]
  ],
  "config": {
    "vocabSize": 300,
    "minFrequency": 2,
    "specialTokens": [
      "<PAD>",
      "<UNK>",
      "<BOS>",
      "<EOS>",
      "<SEP>"
    ]
  }
}