{
  "vocab": {
    "0": 33,
    "1": 29,
    "2": 30,
    "3": 31,
    "4": 34,
    "5": 32,
    "6": 35,
    "7": 36,
    "8": 37,
    "9": 38,
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "▁": 4,
    "h": 5,
    "a": 6,
    "l": 7,
    "o": 8,
    "i": 9,
    "e": 10,
    "y": 11,
    "s": 12,
    "m": 13,
    "t": 14,
    "p": 15,
    "g": 16,
    "n": 17,
    "r": 18,
    "u": 19,
    "k": 20,
    "b": 21,
    "d": 22,
    "c": 23,
    "f": 24,
    "j": 25,
    "x": 26,
    "w": 27,
    "v": 28,
    "pa": 39,
    "apa": 40,
    "▁b": 41,
    "ka": 42,
    "er": 43,
    "an": 44,
    "▁s": 45,
    "▁ka": 46,
    "mu": 47,
    "▁ber": 48,
    "am": 49,
    "▁berapa": 50,
    "▁h": 51,
    "ng": 52,
    "▁t": 53,
    "it": 54,
    "▁kamu": 55,
    "▁apa": 56,
    "▁d": 57,
    "ang": 58,
    "▁1": 59,
    "gi": 60,
    "▁m": 61,
    "▁si": 62,
    "▁k": 63,
    "▁l": 64,
    "ya": 65,
    "▁p": 66,
    "itu": 67,
    "▁se": 68,
    "at": 69,
    "▁c": 70,
    "▁ha": 71,
    "▁siapa": 72,
    "ak": 73,
    "ah": 74,
    "agi": 75,
    "si": 76,
    "in": 77,
    "ri": 78,
    "▁sa": 79,
    "al": 80,
    "▁ke": 81,
    "ik": 82,
    "lo": 83,
    "aka": 84,
    "li": 85,
    "▁j": 86,
    "▁saya": 87,
    "▁ba": 88,
    "▁per": 89,
    "sih": 90,
    "lu": 91,
    "▁hari": 92,
    "rang": 93,
    "▁hitu": 94,
    "▁hitung": 95,
    "as": 96,
    "▁itu": 97,
    "en": 98,
    "tu": 99,
    "▁2": 100,
    "▁di": 101,
    "▁in": 102,
    "▁ini": 103,
    "im": 104,
    "▁ban": 105,
    "▁ti": 106,
    "▁10": 107,
    "▁y": 108,
    "▁n": 109,
    "▁lagi": 110,
    "▁tid": 111,
    "▁tidak": 112,
    "ru": 113,
    "amb": 114,
    "ambah": 115,
    "▁5": 116,
    "▁do": 117,
    "▁bi": 118,
    "aku": 119,
    "▁tambah": 120,
    "▁3": 121,
    "▁baik": 122,
    "▁dong": 123,
    "▁cer": 124,
    "sa": 125,
    "erim": 126,
    "▁aku": 127,
    "ua": 128,
    "▁jam": 129,
    "uat": 130,
    "▁bantu": 131,
    "▁ru": 132,
    "▁rumu": 133,
    "▁rumus": 134,
    "▁pa": 135,
    "▁g": 136,
    "▁nam": 137,
    "▁bisa": 138,
    "▁yang": 139,
    "▁terim": 140,
    "▁kasih": 141,
    "ulu": 142,
    "▁cua": 143,
    "▁cuac": 144,
    "▁seka": 145,
    "▁sekarang": 146,
    "em": 147,
    "▁dib": 148,
    "on": 149,
    "▁lu": 150,
    "et": 151,
    "▁kali": 152,
    "el": 153,
    "▁sel": 154,
    "▁selam": 155,
    "▁selamat": 156,
    "or": 157,
    "ar": 158,
    "▁nama": 159,
    "▁cerit": 160,
    "un": 161,
    "ja": 162,
    "▁terima": 163,
    "akasih": 164,
    "▁ya": 165,
    "▁dulu": 166,
    "▁cuaca": 167,
    "▁to": 168,
    "▁tolo": 169,
    "▁tolong": 170,
    "urang": 171,
    "▁100": 172,
    "▁9": 173,
    "akan": 174,
    "▁makasih": 175,
    "ok": 176,
    "oke": 177,
    "▁sam": 178,
    "▁sampa": 179,
    "▁sampai": 180,
    "▁pergi": 181,
    "ci": 182,
    "▁bu": 183,
    "▁kurang": 184,
    "▁4": 185,
    "▁dibagi": 186,
    "▁25": 187,
    "▁8": 188,
    "alam": 189,
    "um": 190,
    "bar": 191,
    "od": 192,
    "ing": 193,
    "kan": 194,
    "alan": 195,
    "▁f": 196,
    "▁saja": 197,
    "▁bag": 198,
    "ana": 199
  },
  "merges": [
    [
      "p",
      "a"
    ],
    [
      "a",
      "pa"
    ],
    [
      "▁",
      "b"
    ],
    [
      "k",
      "a"
    ],
    [
      "e",
      "r"
    ],
    [
      "a",
      "n"
    ],
    [
      "▁",
      "s"
    ],
    [
      "▁",
      "ka"
    ],
    [
      "m",
      "u"
    ],
    [
      "▁b",
      "er"
    ],
    [
      "a",
      "m"
    ],
    [
      "▁ber",
      "apa"
    ],
    [
      "▁",
      "h"
    ],
    [
      "n",
      "g"
    ],
    [
      "▁",
      "t"
    ],
    [
      "i",
      "t"
    ],
    [
      "▁ka",
      "mu"
    ],
    [
      "▁",
      "apa"
    ],
    [
      "▁",
      "d"
    ],
    [
      "an",
      "g"
    ],
    [
      "▁",
      "1"
    ],
    [
      "g",
      "i"
    ],
    [
      "▁",
      "m"
    ],
    [
      "▁s",
      "i"
    ],
    [
      "▁",
      "k"
    ],
    [
      "▁",
      "l"
    ],
    [
      "y",
      "a"
    ],
    [
      "▁",
      "p"
    ],
    [
      "it",
      "u"
    ],
    [
      "▁s",
      "e"
    ],
    [
      "a",
      "t"
    ],
    [
      "▁",
      "c"
    ],
    [
      "▁h",
      "a"
    ],
    [
      "▁si",
      "apa"
    ],
    [
      "a",
      "k"
    ],
    [
      "a",
      "h"
    ],
    [
      "a",
      "gi"
    ],
    [
      "s",
      "i"
    ],
    [
      "i",
      "n"
    ],
    [
      "r",
      "i"
    ],
    [
      "▁s",
      "a"
    ],
    [
      "a",
      "l"
    ],
    [
      "▁k",
      "e"
    ],
    [
      "i",
      "k"
    ],
    [
      "l",
      "o"
    ],
    [
      "a",
      "ka"
    ],
    [
      "l",
      "i"
    ],
    [
      "▁",
      "j"
    ],
    [
      "▁sa",
      "ya"
    ],
    [
      "▁b",
      "a"
    ],
    [
      "▁p",
      "er"
    ],
    [
      "si",
      "h"
    ],
    [
      "l",
      "u"
    ],
    [
      "▁ha",
      "ri"
    ],
    [
      "r",
      "ang"
    ],
    [
      "▁h",
      "itu"
    ],
    [
      "▁hitu",
      "ng"
    ],
    [
      "a",
      "s"
    ],
    [
      "▁",
      "itu"
    ],
    [
      "e",
      "n"
    ],
    [
      "t",
      "u"
    ],
    [
      "▁",
      "2"
    ],
    [
      "▁d",
      "i"
    ],
    [
      "▁",
      "in"
    ],
    [
      "▁in",
      "i"
    ],
    [
      "i",
      "m"
    ],
    [
      "▁b",
      "an"
    ],
    [
      "▁t",
      "i"
    ],
    [
      "▁1",
      "0"
    ],
    [
      "▁",
      "y"
    ],
    [
      "▁",
      "n"
    ],
    [
      "▁l",
      "agi"
    ],
    [
      "▁ti",
      "d"
    ],
    [
      "▁tid",
      "ak"
    ],
    [
      "r",
      "u"
    ],
    [
      "am",
      "b"
    ],
    [
      "amb",
      "ah"
    ],
    [
      "▁",
      "5"
    ],
    [
      "▁d",
      "o"
    ],
    [
      "▁b",
      "i"
    ],
    [
      "ak",
      "u"
    ],
    [
      "▁t",
      "ambah"
    ],
    [
      "▁",
      "3"
    ],
    [
      "▁ba",
      "ik"
    ],
    [
      "▁do",
      "ng"
    ],
    [
      "▁c",
      "er"
    ],
    [
      "s",
      "a"
    ],
    [
      "er",
      "im"
    ],
    [
      "▁",
      "aku"
    ],
    [
      "u",
      "a"
    ],
    [
      "▁j",
      "am"
    ],
    [
      "u",
      "at"
    ],
    [
      "▁ban",
      "tu"
    ],
    [
      "▁",
      "ru"
    ],
    [
      "▁ru",
      "mu"
    ],
    [
      "▁rumu",
      "s"
    ],
    [
      "▁",
      "pa"
    ],
    [
      "▁",
      "g"
    ],
    [
      "▁n",
      "am"
    ],
    [
      "▁bi",
      "sa"
    ],
    [
      "▁y",
      "ang"
    ],
    [
      "▁t",
      "erim"
    ],
    [
      "▁ka",
      "sih"
    ],
    [
      "u",
      "lu"
    ],
    [
      "▁c",
      "ua"
    ],
    [
      "▁cua",
      "c"
    ],
    [
      "▁se",
      "ka"
    ],
    [
      "▁seka",
      "rang"
    ],
    [
      "e",
      "m"
    ],
    [
      "▁di",
      "b"
    ],
    [
      "o",
      "n"
    ],
    [
      "▁l",
      "u"
    ],
    [
      "e",
      "t"
    ],
    [
      "▁ka",
      "li"
    ],
    [
      "e",
      "l"
    ],
    [
      "▁se",
      "l"
    ],
    [
      "▁sel",
      "am"
    ],
    [
      "▁selam",
      "at"
    ],
    [
      "o",
      "r"
    ],
    [
      "a",
      "r"
    ],
    [
      "▁nam",
      "a"
    ],
    [
      "▁cer",
      "it"
    ],
    [
      "u",
      "n"
    ],
    [
      "j",
      "a"
    ],
    [
      "▁terim",
      "a"
    ],
    [
      "aka",
      "sih"
    ],
    [
      "▁",
      "ya"
    ],
    [
      "▁d",
      "ulu"
    ],
    [
      "▁cuac",
      "a"
    ],
    [
      "▁t",
      "o"
    ],
    [
      "▁to",
      "lo"
    ],
    [
      "▁tolo",
      "ng"
    ],
    [
      "u",
      "rang"
    ],
    [
      "▁10",
      "0"
    ],
    [
      "▁",
      "9"
    ],
    [
      "aka",
      "n"
    ],
    [
      "▁m",
      "akasih"
    ],
    [
      "o",
      "k"
    ],
    [
      "ok",
      "e"
    ],
    [
      "▁s",
      "am"
    ],
    [
      "▁sam",
      "pa"
    ],
    [
      "▁sampa",
      "i"
    ],
    [
      "▁per",
      "gi"
    ],
    [
      "c",
      "i"
    ],
    [
      "▁b",
      "u"
    ],
    [
      "▁k",
      "urang"
    ],
    [
      "▁",
      "4"
    ],
    [
      "▁dib",
      "agi"
    ],
    [
      "▁2",
      "5"
    ],
    [
      "▁",
      "8"
    ],
    [
      "al",
      "am"
    ],
    [
      "u",
      "m"
    ],
    [
      "b",
      "ar"
    ],
    [
      "o",
      "d"
    ],
    [
      "i",
      "ng"
    ],
    [
      "ka",
      "n"
    ],
    [
      "al",
      "an"
    ],
    [
      "▁",
      "f"
    ],
    [
      "▁sa",
      "ja"
    ],
    [
      "▁ba",
      "g"
    ],
    [
      "an",
      "a"
    ]
  ],
  "config": {
    "vocabSize": 200,
    "minFrequency": 2,
    "specialTokens": [
      "<PAD>",
      "<UNK>",
      "<BOS>",
      "<EOS>"
    ]
  }
}