{
  "vocab": {
    "0": 83,
    "1": 77,
    "2": 75,
    "3": 82,
    "4": 88,
    "5": 93,
    "6": 96,
    "7": 81,
    "8": 98,
    "9": 78,
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "<SEP>": 4,
    "▁": 55,
    "i": 56,
    "n": 57,
    "s": 58,
    "t": 59,
    "r": 60,
    "u": 61,
    "k": 62,
    ":": 63,
    "j": 64,
    "a": 65,
    "w": 66,
    "b": 67,
    "p": 68,
    "e": 69,
    "y": 70,
    "m": 71,
    ".": 72,
    "x": 73,
    "+": 74,
    "=": 76,
    ",": 79,
    "?": 80,
    "d": 84,
    "l": 85,
    "h": 86,
    "c": 87,
    "-": 89,
    "g": 90,
    "v": 91,
    "o": 92,
    "%": 94,
    "/": 95,
    "f": 97,
    "{": 99,
    "}": 100,
    "(": 101,
    ")": 102,
    "'": 103,
    "→": 104,
    "*": 105,
    "²": 106,
    "×": 107,
    "̄": 108,
    "ȳ": 109,
    "σ": 110,
    "−": 111,
    "^": 112,
    "[": 113,
    "]": 114,
    "δ": 115,
    "`": 116,
    ";": 117,
    "_": 118,
    "q": 119,
    ">": 120,
    "<": 121,
    "z": 122,
    "an": 5,
    "er": 6,
    "at": 7,
    "▁j": 8,
    "▁i": 9,
    "ik": 10,
    "▁ja": 11,
    "ut": 12,
    "mat": 13,
    "ab": 14,
    "▁jaw": 15,
    "▁jawab": 16,
    "▁in": 17,
    "▁p": 18,
    "▁b": 19,
    "si": 20,
    "▁per": 21,
    "ya": 22,
    "▁ber": 23,
    "ika": 24,
    "uk": 25,
    "tan": 26,
    "▁mat": 27,
    "▁mate": 28,
    "▁matemat": 29,
    "▁matematika": 30,
    "▁pertan": 31,
    "▁pertanya": 32,
    "▁pertanyaan": 33,
    "st": 34,
    "put": 35,
    "str": 36,
    "▁input": 37,
    "ikut": 38,
    "▁berikut": 39,
    "▁instr": 40,
    "▁instruk": 41,
    "▁instruksi": 42,
    "▁jawaban": 43,
    "al": 44,
    "▁a": 45,
    "ah": 46,
    "▁d": 47,
    "▁s": 48,
    "en": 49,
    "pa": 50,
    "ar": 51,
    "▁m": 52,
    "ang": 53,
    "alah": 54,
    "▁ad": 123,
    "▁adalah": 124,
    "tu": 125,
    "▁k": 126,
    "▁x": 127,
    "am": 128,
    "▁apa": 129,
    "el": 130,
    "▁itu": 131,
    "ng": 132,
    "▁t": 133,
    "▁se": 134,
    "il": 135,
    "eng": 136,
    "em": 137,
    "ari": 138,
    "kan": 139,
    "um": 140,
    "▁y": 141,
    "gi": 142,
    "▁l": 143,
    "un": 144,
    "as": 145,
    "▁di": 146,
    "di": 147,
    "▁r": 148,
    "▁pers": 149,
    "ama": 150,
    "▁su": 151,
    "apa": 152,
    "ur": 153,
    "ata": 154,
    "▁h": 155,
    "ga": 156,
    "ul": 157,
    "ol": 158,
    "▁yang": 159,
    "▁sud": 160,
    "▁berapa": 161,
    "uml": 162,
    "umlah": 163,
    "▁sudut": 164,
    "nya": 165,
    "ali": 166,
    "▁men": 167,
    "engan": 168,
    "▁dengan": 169,
    "angan": 170,
    "ti": 171,
    "ak": 172,
    "▁dan": 173,
    "▁ke": 174,
    "▁mem": 175,
    "▁si": 176,
    "▁dari": 177,
    "ing": 178,
    "▁so": 179,
    "elas": 180,
    "▁bil": 181,
    "▁bilangan": 182,
    "▁n": 183,
    "▁jelas": 184,
    "ua": 185,
    "bu": 186,
    "▁soal": 187,
    "tuk": 188,
    "agi": 189,
    "mp": 190,
    "▁jumlah": 191,
    "ahan": 192,
    "ec": 193,
    "▁jelaskan": 194,
    "▁pen": 195,
    "▁sisi": 196,
    "gr": 197,
    "▁jadi": 198,
    "ai": 199,
    "olo": 200,
    "or": 201,
    "ecahan": 202,
    "▁sama": 203,
    "▁ter": 204,
    "▁tolo": 205,
    "▁tolong": 206,
    "▁meng": 207,
    "▁persama": 208,
    "▁persamaan": 209,
    "▁perse": 210,
    "▁persegi": 211,
    "us": 212,
    "▁v": 213,
    "amb": 214,
    "▁kali": 215,
    "asi": 216,
    "▁g": 217,
    "in": 218,
    "▁pecahan": 219,
    "▁c": 220,
    "on": 221,
    "▁hi": 222,
    "da": 223,
    "▁jika": 224,
    "ek": 225,
    "is": 226,
    "▁ti": 227,
    "▁data": 228,
    "▁pr": 229,
    "▁penj": 230,
    "ilai": 231,
    "▁nilai": 232,
    "es": 233,
    "ngan": 234,
    "▁dua": 235,
    "alam": 236,
    "ter": 237,
    "▁segi": 238,
    "▁segiti": 239,
    "▁segitiga": 240,
    "gram": 241,
    "▁perk": 242,
    "▁perkali": 243,
    "▁perkalian": 244,
    "▁set": 245,
    "iki": 246,
    "bagi": 247,
    "una": 248,
    "▁penjumlah": 249,
    "▁penjumlahan": 250,
    "aj": 251,
    "iliki": 252,
    "ambah": 253,
    "unakan": 254,
    "ja": 255,
    "▁himp": 256,
    "▁himpun": 257,
    "▁himpunan": 258,
    "▁dalam": 259,
    "▁pem": 260,
    "▁ben": 261,
    "▁memiliki": 262,
    "andi": 263,
    "esi": 264,
    "eb": 265,
    "▁un": 266,
    "▁untuk": 267,
    "▁f": 268,
    "▁pro": 269,
    "bandi": 270,
    "▁o": 271,
    "pat": 272,
    "ikan": 273,
    "ariab": 274,
    "▁gari": 275,
    "▁garis": 276,
    "ih": 277,
    "up": 278,
    "▁variab": 279,
    "▁variabel": 280,
    "▁kum": 281,
    "▁kump": 282,
    "▁kumpul": 283,
    "▁kumpulan": 284,
    "▁der": 285,
    "▁deraj": 286,
    "▁derajat": 287,
    "angun": 288,
    "▁dat": 289,
    "▁rata": 290,
    "rata": 291,
    "▁bentuk": 292,
    "jadi": 293,
    "▁mak": 294,
    "ri": 295,
    "kar": 296,
    "gunakan": 297,
    "▁mis": 298,
    "▁misal": 299,
    "arga": 300,
    "▁bangun": 301,
    "▁datar": 302,
    "▁sk": 303,
    "▁maka": 304,
    "orang": 305,
    "ap": 306,
    "od": 307,
    "▁an": 308,
    "▁ar": 309,
    "▁seh": 310,
    "▁menjadi": 311,
    "▁kar": 312,
    "ala": 313,
    "▁peng": 314,
    "▁tan": 315,
    "anya": 316,
    "▁harga": 317,
    "anj": 318,
    "urang": 319,
    "▁re": 320,
    "▁seorang": 321,
    "elah": 322,
    "ot": 323,
    "▁ri": 324,
    "▁ribu": 325,
    "itu": 326,
    "▁persen": 327,
    "ef": 328,
    "▁skala": 329,
    "▁pert": 330,
    "▁al": 331,
    "▁misalkan": 332,
    "▁setelah": 333,
    "ung": 334,
    "anjang": 335,
    "ada": 336,
    "iku": 337,
    "ses": 338,
    "▁ling": 339,
    "▁lingkar": 340,
    "▁lingkaran": 341,
    "▁pembagi": 342,
    "▁bagi": 343,
    "▁li": 344,
    "▁perbandi": 345,
    "▁perbandingan": 346,
    "▁kel": 347,
    "▁sem": 348,
    "▁pembagian": 349,
    "ena": 350,
    "elem": 351,
    "asalah": 352,
    "▁kelil": 353,
    "▁keliling": 354,
    "▁sebu": 355,
    "▁sebuah": 356,
    "asil": 357,
    "▁karena": 358,
    "▁ked": 359,
    "elemen": 360,
    "▁lo": 361,
    "oh": 362,
    "▁sol": 363,
    "▁solu": 364,
    "▁solusi": 365,
    "uh": 366,
    "eter": 367,
    "▁kedua": 368,
    "▁pada": 369,
    "isi": 370,
    "▁proses": 371,
    "engah": 372,
    "▁alj": 373,
    "▁aljab": 374,
    "▁aljabar": 375,
    "ingga": 376,
    "▁rup": 377,
    "▁rupi": 378,
    "▁rupiah": 379,
    "▁mod": 380,
    "▁model": 381,
    "▁elemen": 382,
    "ulang": 383,
    "▁em": 384,
    "▁empat": 385,
    "▁rum": 386,
    "▁rumus": 387,
    "▁lu": 388,
    "mpul": 389,
    "▁sehingga": 390,
    "▁sub": 391,
    "▁dia": 392,
    "▁diagram": 393,
    "▁ven": 394,
    "▁venn": 395,
    "▁bul": 396,
    "▁bulat": 397,
    "urangi": 398,
    "mal": 399,
    "▁leb": 400,
    "atu": 401,
    "▁regr": 402,
    "▁berulang": 403,
    "def": 404,
    "▁tit": 405,
    "▁titik": 406,
    "anyak": 407,
    "alikan": 408,
    "▁tu": 409,
    "ula": 410,
    "▁regresi": 411,
    "▁ser": 412,
    "▁pengur": 413,
    "▁pengurangan": 414,
    "▁desi": 415,
    "▁desimal": 416,
    "aat": 417,
    "▁masalah": 418,
    "▁luas": 419,
    "ci": 420,
    "▁banyak": 421,
    "▁diam": 422,
    "▁diameter": 423,
    "▁hasil": 424,
    "▁dip": 425,
    "▁satu": 426,
    "ara": 427,
    "▁menambah": 428,
    "▁dit": 429,
    "▁tot": 430,
    "▁total": 431,
    "▁arr": 432,
    "▁ant": 433,
    "▁uk": 434,
    "▁ukur": 435,
    "▁ukuran": 436,
    "▁log": 437,
    "▁jari": 438,
    "jari": 439,
    "▁semua": 440,
    "▁tumpul": 441,
    "▁lebih": 442,
    "▁digunakan": 443,
    "▁bu": 444,
    "alu": 445,
    "ual": 446,
    "▁aw": 447,
    "▁awal": 448,
    "wa": 449,
    "▁dib": 450,
    "et": 451,
    "unj": 452,
    "▁ob": 453,
    "▁obj": 454,
    "▁objek": 455,
    "▁con": 456,
    "▁cont": 457,
    "▁contoh": 458,
    "▁setengah": 459,
    "balikan": 460,
    "▁menggunakan": 461,
    "▁sis": 462,
    "angk": 463,
    "▁pertama": 464,
    "tung": 465,
    "▁list": 466,
    "ac": 467,
    "inisi": 468,
    "esar": 469,
    "▁panjang": 470,
    "▁man": 471,
    "▁dibagi": 472,
    "▁ten": 473,
    "elur": 474,
    "eluruh": 475,
    "▁um": 476,
    "▁umur": 477,
    "ir": 478,
    "▁hitung": 479,
    "▁program": 480,
    "▁serat": 481,
    "▁seratus": 482,
    "▁hu": 483,
    "▁hubu": 484,
    "▁hubungan": 485,
    "ola": 486,
    "▁bagian": 487,
    "▁tid": 488,
    "▁tidak": 489,
    "▁ditambah": 490,
    "▁seb": 491,
    "▁lalu": 492,
    "▁jam": 493,
    "ed": 494,
    "▁bar": 495,
    "▁siswa": 496,
    "▁ko": 497,
    "▁arra": 498,
    "▁array": 499,
    "ati": 500,
    "ngkan": 501,
    "▁terdef": 502,
    "▁terdefinisi": 503,
    "▁siku": 504,
    "siku": 505,
    "▁mel": 506,
    "▁jar": 507,
    "▁jarak": 508,
    "emu": 509,
    "▁arti": 510,
    "tang": 511,
    "mb": 512,
    "for": 513,
    "▁ia": 514,
    "▁st": 515,
    "urut": 516,
    "op": 517,
    "fs": 518,
    "▁logika": 519,
    "▁tanpa": 520,
    "▁pertemu": 521,
    "▁pertemuan": 522,
    "▁tiga": 523,
    "▁artinya": 524,
    "▁kebalikan": 525,
    "▁kes": 526,
    "▁keseluruh": 527,
    "▁keseluruhan": 528,
    "form": 529,
    "it": 530,
    "▁menc": 531,
    "ok": 532,
    "▁seti": 533,
    "▁setiap": 534,
    "▁barang": 535,
    "sit": 536,
    "edik": 537,
    "ediksi": 538,
    "ukan": 539,
    "yt": 540,
    "yth": 541,
    "ython": 542,
    "▁menunj": 543,
    "▁menunjuk": 544,
    "atif": 545,
    "▁besar": 546,
    "▁manf": 547,
    "▁manfaat": 548,
    "▁melat": 549,
    "▁melatih": 550,
    "▁pemecahan": 551,
    "▁membu": 552,
    "▁lan": 553,
    "▁lanci": 554,
    "▁lancip": 555,
    "▁inform": 556,
    "▁informasi": 557,
    "▁kalimat": 558,
    "▁tanda": 559,
    "ina": 560,
    "ob": 561,
    "sitas": 562,
    "▁sel": 563,
    "err": 564,
    "error": 565,
    "tur": 566,
    "▁langk": 567,
    "▁langkah": 568,
    "▁programm": 569,
    "end": 570,
    "▁mengapa": 571,
    "▁dp": 572,
    "▁gamb": 573,
    "▁gambar": 574,
    "▁menunjukkan": 575,
    "▁antar": 576,
    "▁po": 577,
    "tif": 578,
    "▁membandi": 579,
    "▁membandingkan": 580,
    "▁membuat": 581,
    "▁banyaknya": 582,
    "gan": 583,
    "▁buk": 584,
    "▁hasilnya": 585,
    "▁ini": 586,
    "▁memb": 587,
    "eli": 588,
    "▁perm": 589,
    "▁u": 590,
    "▁dik": 591,
    "▁subst": 592,
    "▁substitu": 593,
    "ub": 594,
    "▁fung": 595,
    "▁fungsi": 596,
    "▁ata": 597,
    "▁atau": 598,
    "hitu": 599,
    "▁ne": 600,
    "▁neg": 601,
    "▁negatif": 602,
    "▁posi": 603,
    "▁memanjang": 604,
    "▁lur": 605,
    "▁lurus": 606,
    "▁mengurangi": 607,
    "ep": 608,
    "mu": 609,
    "▁buku": 610,
    "dapat": 611,
    "af": 612,
    "▁permen": 613,
    "ui": 614,
    "▁gunakan": 615,
    "▁substitusi": 616,
    "▁diber": 617,
    "▁diberikan": 618,
    "▁python": 619,
    "arr": 620,
    "turn": 621,
    "hitung": 622,
    "▁terdi": 623,
    "▁terdiri": 624,
    "▁nol": 625,
    "▁positif": 626,
    "▁il": 627,
    "▁ilmu": 628,
    "▁tentang": 629,
    "▁pola": 630,
    "▁kurangi": 631,
    "▁semula": 632,
    "▁tambah": 633,
    "▁diper": 634,
    "▁menj": 635,
    "▁tah": 636,
    "▁tahun": 637,
    "elum": 638,
    "ain": 639,
    "▁ak": 640,
    "▁anak": 641,
    "ogram": 642,
    "ma": 643,
    "erja": 644,
    "rediksi": 645,
    "▁error": 646,
    "▁sl": 647,
    "▁kod": 648,
    "▁kode": 649,
    "ev": 650,
    "pend": 651,
    "▁komp": 652,
    "▁ya": 653,
    "▁yaitu": 654,
    "ursi": 655,
    "ib": 656,
    "▁bis": 657,
    "▁bisa": 658,
    "▁benar": 659,
    "▁keh": 660,
    "▁kehi": 661,
    "▁kehid": 662,
    "▁kehidup": 663,
    "▁kehidupan": 664,
    "▁sehari": 665,
    "hari": 666,
    "▁simb": 667,
    "▁simbol": 668,
    "▁penggan": 669,
    "▁pengganti": 670,
    "▁cer": 671,
    "▁cerit": 672,
    "▁cerita": 673,
    "▁sed": 674,
    "▁ro": 675,
    "▁menem": 676,
    "▁penjual": 677,
    "▁sebelum": 678,
    "▁beras": 679,
    "▁ters": 680,
    "▁terseb": 681,
    "▁tersebut": 682,
    "▁liter": 683,
    "▁isi": 684,
    "▁uang": 685,
    "etah": 686,
    "etahui": 687,
    "ana": 688,
    "▁gr": 689,
    "▁saat": 690,
    "▁slop": 691,
    "▁slope": 692,
    "▁sec": 693,
    "▁secara": 694,
    "▁return": 695,
    "▁out": 696,
    "▁output": 697,
    "aga": 698,
    "agai": 699,
    "▁iter": 700,
    "ic": 701,
    "evel": 702,
    "ue": 703,
    "▁sor": 704,
    "▁sort": 705,
    "▁bfs": 706,
    "eks": 707,
    "ary": 708,
    "▁besarnya": 709,
    "▁ada": 710,
    "▁berk": 711,
    "aran": 712,
    "▁mencari": 713,
    "▁buah": 714,
    "▁lagi": 715,
    "▁sekar": 716,
    "▁sekarang": 717,
    "▁dika": 718,
    "▁tambahkan": 719,
    "▁roti": 720,
    "sa": 721,
    "▁totalnya": 722,
    "▁pendapat": 723,
    "▁pendapatan": 724,
    "▁pena": 725,
    "hir": 726,
    "▁poh": 727,
    "▁pohon": 728,
    "▁tang": 729,
    "▁kil": 730,
    "▁kilogram": 731,
    "urutan": 732,
    "▁tengah": 733,
    "▁ingi": 734,
    "▁ingin": 735,
    "▁antara": 736,
    "▁diprediksi": 737,
    "▁penjualan": 738,
    "alis": 739,
    "▁tentuk": 740,
    "▁tentukan": 741,
    "▁perub": 742,
    "▁perubahan": 743,
    "▁menul": 744,
    "▁menulis": 745,
    "▁outputnya": 746,
    "▁iterasi": 747,
    "▁kompl": 748,
    "▁komplek": 749,
    "▁kompleksitas": 750,
    "▁rek": 751,
    "▁rekursi": 752,
    "▁fib": 753,
    "▁fibon": 754,
    "▁fibonac": 755,
    "▁fibonacci": 756,
    "▁dy": 757,
    "▁dyn": 758,
    "▁dynam": 759,
    "▁dynamic": 760,
    "▁programming": 761,
    "▁kurang": 762,
    "▁beb": 763,
    "▁beber": 764,
    "▁beberapa": 765,
    "▁pe": 766,
    "▁mula": 767,
    "mula": 768,
    "▁jer": 769,
    "▁jeruk": 770,
    "▁menambahkan": 771,
    "ungan": 772,
    "ole": 773,
    "oleh": 774,
    "▁hari": 775,
    "▁menjual": 776,
    "▁tiap": 777,
    "▁stik": 778,
    "▁stiker": 779,
    "▁masi": 780,
    "▁membeli": 781,
    "▁jambu": 782,
    "▁air": 783,
    "▁put": 784,
    "▁putaran": 785,
    "▁bola": 786,
    "ekerja": 787,
    "om": 788,
    "se": 789,
    "▁diketahui": 790,
    "aik": 791,
    "le": 792,
    "▁kec": 793,
    "▁bagai": 794,
    "▁bagaim": 795,
    "▁bagaimana": 796,
    "▁urutan": 797,
    "▁str": 798,
    "▁string": 799,
    "rue": 800,
    "ungk": 801,
    "ungkin": 802,
    "hasil": 803,
    "per": 804,
    "▁level": 805,
    "pr": 806,
    "▁ut": 807,
    "angkan": 808,
    "▁graf": 809,
    "▁dfs": 810,
    "masalah": 811,
    "▁akan": 812,
    "▁meny": 813,
    "cs": 814,
    "arnya": 815,
    "▁tok": 816,
    "▁toko": 817,
    "▁stok": 818,
    "▁tersi": 819,
    "▁tersisa": 820,
    "puh": 821,
    "▁bah": 822,
    "▁awalnya": 823,
    "▁masih": 824,
    "ainan": 825,
    "▁karung": 826,
    "▁meter": 827,
    "ambil": 828,
    "▁mer": 829,
    "▁kapa": 830,
    "▁kapasitas": 831,
    "▁bi": 832,
    "elaj": 833,
    "▁analis": 834,
    "▁menemukan": 835,
    "▁lin": 836,
    "▁line": 837,
    "▁linear": 838,
    "▁naik": 839,
    "ingk": 840,
    "ingkat": 841,
    "▁inter": 842,
    "▁mul": 843,
    "▁kecil": 844,
    "▁programmer": 845,
    "append": 846,
    "▁w": 847,
    "▁terb": 848,
    "iri": 849,
    "▁kan": 850,
    "▁kanan": 851,
    "▁sam": 852,
    "▁sampa": 853,
    "▁sampai": 854,
    "▁berb": 855,
    "▁simpul": 856,
    "▁menghitung": 857,
    "▁submasalah": 858,
    "▁misalnya": 859,
    "▁dihitung": 860,
    "▁ind": 861,
    "▁indeks": 862,
    "▁bin": 863,
    "▁binary": 864,
    "▁sear": 865,
    "▁searc": 866,
    "▁search": 867,
    "▁terurut": 868,
    "▁pus": 869,
    "▁pusat": 870,
    "▁tep": 871,
    "▁tepi": 872,
    "▁tak": 873,
    "▁rina": 874,
    "▁berkata": 875,
    "▁ker": 876,
    "▁budi": 877,
    "▁tab": 878,
    "▁tabungan": 879,
    "ad": 880,
    "▁diperoleh": 881,
    "▁km": 882,
    "▁ditem": 883,
    "▁nina": 884,
    "▁pun": 885,
    "▁skor": 886,
    "▁raf": 887,
    "▁rafi": 888,
    "▁kalikan": 889,
    "▁mainan": 890,
    "▁paj": 891,
    "▁pajak": 892,
    "▁tangk": 893,
    "▁tangki": 894,
    "▁lina": 895,
    "▁sak": 896,
    "▁saku": 897,
    "ji": 898,
    "▁ik": 899,
    "das": 900,
    "alaman": 901,
    "▁aktu": 902,
    "▁aktual": 903,
    "▁prediksi": 904,
    "▁meningkat": 905,
    "▁manual": 906,
    "▁interc": 907,
    "▁intercep": 908,
    "▁intercept": 909,
    "▁angk": 910,
    "▁angka": 911,
    "▁for": 912,
    "▁cara": 913,
    "▁mulai": 914,
    "aca": 915,
    "▁loop": 916,
    "▁mengem": 917,
    "▁mengembalikan": 918,
    "▁prin": 919,
    "▁print": 920,
    "▁if": 921,
    "len": 922,
    "▁wak": 923,
    "▁waktu": 924,
    "▁bub": 925,
    "▁bubb": 926,
    "▁bubble": 927,
    "uruk": 928,
    "▁mungkin": 929,
    "ukar": 930,
    "▁menghasil": 931,
    "▁menghasilkan": 932,
    "ge": 933,
    "tion": 934,
    "▁utama": 935,
    "ex": 936,
    "▁berbob": 937,
    "▁berbobot": 938,
    "▁dil": 939,
    "▁e": 940,
    "▁te": 941,
    "▁tetang": 942,
    "▁tetangga": 943,
    "▁terl": 944,
    "▁bias": 945,
    "▁biasanya": 946,
    "▁jal": 947,
    "▁jalur": 948,
    "ack": 949,
    "▁terpend": 950,
    "▁terpendek": 951,
    "▁da": 952,
    "▁dapat": 953,
    "▁tet": 954,
    "▁tetap": 955,
    "▁polo": 956,
    "▁polos": 957,
    "▁menyi": 958,
    "▁menyimp": 959,
    "▁menyimpan": 960,
    "dp": 961,
    "▁terak": 962,
    "▁terakhir": 963,
    "▁hanya": 964,
    "▁memak": 965,
    "▁memakai": 966,
    "▁sang": 967,
    "▁sangat": 968,
    "ubah": 969,
    "▁lcs": 970,
    "▁pref": 971,
    "▁prefi": 972,
    "▁prefix": 973,
    "inj": 974,
    "injam": 975,
    "▁peda": 976,
    "▁pedag": 977,
    "▁pedagang": 978,
    "▁keranjang": 979,
    "▁dikal": 980,
    "▁kelas": 981,
    "▁ku": 982,
    "▁kuas": 983,
    "▁pagi": 984,
    "▁mob": 985,
    "▁mobil": 986,
    "▁menempuh": 987,
    "rim": 988,
    "atakan": 989,
    "▁bahwa": 990,
    "▁berkurang": 991,
    "▁akhir": 992,
    "▁berisi": 993,
    "▁dipa": 994,
    "▁dipak": 995,
    "▁dipakai": 996,
    "▁diambil": 997,
    "▁aya": 998,
    "▁ayah": 999,
    "jika": 1000,
    "▁dikurangi": 1001,
    "▁pensi": 1002,
    "▁pensil": 1003,
    "▁cm": 1004,
    "▁lebarnya": 1005,
    "▁setengahnya": 1006,
    "▁pekerja": 1007,
    "▁mendapat": 1008,
    "▁bekerja": 1009,
    "▁dis": 1010,
    "▁bilangannya": 1011,
    "▁peneli": 1012,
    "▁peneliti": 1013,
    "▁belaj": 1014,
    "▁belajar": 1015,
    "▁ikl": 1016,
    "▁iklan": 1017,
    "▁berdas": 1018,
    "▁berdasar": 1019,
    "▁berdasarkan": 1020,
    "▁pengalaman": 1021,
    "▁kerja": 1022,
    "▁mx": 1023,
    "▁terh": 1024,
    "▁terhada": 1025,
    "▁terhadap": 1026,
    "▁bergan": 1027,
    "akukan": 1028,
    "▁membaca": 1029,
    "▁seles": 1030,
    "▁selesai": 1031,
    "arti": 1032,
    "▁seluruh": 1033,
    "python": 1034,
    "true": 1035,
    "▁co": 1036,
    "▁alg": 1037,
    "▁algor": 1038,
    "▁algorit": 1039,
    "▁algoritma": 1040,
    "▁kiri": 1041,
    "▁bandi": 1042,
    "▁bandingkan": 1043,
    "▁tukar": 1044,
    "ind": 1045,
    "▁merge": 1046,
    "▁terus": 1047,
    "ilih": 1048,
    "ext": 1049,
    "extend": 1050,
    "▁sedangkan": 1051,
    "unjung": 1052,
    "unjungi": 1053,
    "▁terleb": 1054,
    "▁terlebih": 1055,
    "▁dah": 1056,
    "▁dahul": 1057,
    "▁dahulu": 1058,
    "emb": 1059,
    "▁sering": 1060,
    "▁eks": 1061,
    "est": 1062,
    "▁ket": 1063,
    "▁ketika": 1064,
    "▁tetapi": 1065,
    "▁ef": 1066,
    "▁memang": 1067,
    "▁ju": 1068,
    "▁juga": 1069,
    "▁tangga": 1070,
    "▁mencapa": 1071,
    "▁mencapai": 1072,
    "perti": 1073,
    "▁it": 1074,
    "▁item": 1075,
    "▁vali": 1076,
    "▁valid": 1077,
    "▁terjadi": 1078,
    "▁true": 1079,
    "▁salah": 1080,
    "▁sudah": 1081,
    "▁penc": 1082,
    "▁pencari": 1083,
    "▁pencarian": 1084,
    "▁ham": 1085,
    "▁hamp": 1086,
    "▁hampir": 1087,
    "ce": 1088,
    "▁ov": 1089,
    "▁over": 1090,
    "▁overl": 1091,
    "▁overlap": 1092,
    "▁overlapp": 1093,
    "▁overlapping": 1094,
    "▁subpr": 1095,
    "▁subprob": 1096,
    "▁subprobl": 1097,
    "▁subproblem": 1098,
    "▁subproblems": 1099,
    "▁meminjam": 1100,
    "kala": 1101,
    "kalau": 1102,
    "▁seben": 1103,
    "▁sebenarnya": 1104,
    "abung": 1105,
    "bun": 1106,
    "▁dikali": 1107,
    "pada": 1108,
    "▁cad": 1109,
    "▁cadangan": 1110,
    "▁ting": 1111,
    "▁umurnya": 1112,
    "▁ditempuh": 1113,
    "▁es": 1114,
    "▁krim": 1115,
    "▁mengatakan": 1116,
    "▁pendapatannya": 1117,
    "▁tamb": 1118,
    "▁tambahan": 1119,
    "▁sej": 1120,
    "▁sejumlah": 1121,
    "ag": 1122,
    "annya": 1123,
    "▁punya": 1124,
    "▁berh": 1125,
    "▁berharga": 1126,
    "▁akhirnya": 1127,
    "▁petan": 1128,
    "▁petani": 1129,
    "▁sek": 1130,
    "angga": 1131,
    "▁isinya": 1132,
    "▁sisa": 1133,
    "▁ed": 1134,
    "▁berl": 1135,
    "▁panjangnya": 1136,
    "▁kot": 1137,
    "▁kotak": 1138,
    "▁lima": 1139,
    "▁penuh": 1140,
    "▁ga": 1141,
    "▁gaji": 1142,
    "▁lain": 1143,
    "▁lainnya": 1144,
    "▁umurk": 1145,
    "▁umurku": 1146,
    "aya": 1147,
    "▁suatu": 1148,
    "▁mengetahui": 1149,
    "▁uji": 1150,
    "▁ujian": 1151,
    "▁mendapatkan": 1152,
    "▁seder": 1153,
    "▁sederh": 1154,
    "▁sederhana": 1155,
    "▁selama": 1156,
    "▁diperl": 1157,
    "▁diperlukan": 1158,
    "▁suh": 1159,
    "▁suhu": 1160,
    "▁ek": 1161,
    "▁memp": 1162,
    "▁memprediksi": 1163,
    "▁sese": 1164,
    "▁seseorang": 1165,
    "▁gra": 1166,
    "▁gradi": 1167,
    "▁gradien": 1168,
    "▁modelnya": 1169,
    "▁bert": 1170,
    "▁bertambah": 1171,
    "isien": 1172,
    "enti": 1173,
    "▁berganda": 1174,
    "▁sebesar": 1175,
    "ta": 1176,
    "num": 1177,
    "nums": 1178,
    "▁berarti": 1179,
    "▁dibal": 1180,
    "▁dibalik": 1181,
    "▁mengec": 1182,
    "▁mengecek": 1183,
    "▁apak": 1184,
    "▁apakah": 1185,
    "▁pali": 1186,
    "dr": 1187,
    "▁is": 1188,
    "level": 1189,
    "alse": 1190,
    "▁gen": 1191,
    "▁genap": 1192,
    "▁ken": 1193,
    "▁kenapa": 1194,
    "▁baru": 1195,
    "▁kas": 1196,
    "▁kasus": 1197,
    "▁terburuk": 1198,
    "▁oper": 1199,
    "▁operasi": 1200,
    "▁pas": 1201,
    "▁pass": 1202,
    "▁terbesar": 1203,
    "▁membagi": 1204,
    "oses": 1205,
    "▁kompleksitasnya": 1206,
    "urutkan": 1207,
    "▁selec": 1208,
    "▁selection": 1209,
    "▁dipilih": 1210,
    "▁terk": 1211,
    "▁terkec": 1212,
    "▁terkecil": 1213,
    "▁perb": 1214,
    "▁perbe": 1215,
    "▁perbeda": 1216,
    "▁perbedaan": 1217,
    "▁dilakukan": 1218,
    "▁kunj": 1219,
    "▁kunjungan": 1220,
    "▁mengunjungi": 1221,
    "▁lang": 1222,
    "▁langs": 1223,
    "▁langsung": 1224,
    "▁sedalam": 1225,
    "▁kon": 1226,
    "▁menjelaj": 1227,
    "▁menjelajah": 1228,
    "dek": 1229,
    "dekat": 1230,
    "▁q": 1231,
    "▁mun": 1232,
    "▁eksp": 1233,
    "onen": 1234,
    "ort": 1235,
    "▁berj": 1236,
    "▁berjar": 1237,
    "▁berjarak": 1238,
    "usnya": 1239,
    "▁ditemukan": 1240,
    "▁dij": 1241,
    "gil": 1242,
    "▁menyeb": 1243,
    "▁menyebab": 1244,
    "▁menyebabkan": 1245,
    "▁pekerjaan": 1246,
    "▁dup": 1247,
    "▁dupl": 1248,
    "▁ulang": 1249,
    "▁bot": 1250,
    "▁bott": 1251,
    "▁bottom": 1252,
    "▁stat": 1253,
    "▁state": 1254,
    "▁maksi": 1255,
    "▁maksim": 1256,
    "▁maksimum": 1257,
    "▁keput": 1258,
    "▁keputus": 1259,
    "▁keputusan": 1260,
    "▁bug": 1261,
    "▁utam": 1262,
    "▁utamanya": 1263,
    "alisasi": 1264,
    "▁pad": 1265,
    "▁padah": 1266,
    "▁padahal": 1267,
    "▁solusinya": 1268,
    "▁berikutnya": 1269,
    "▁rang": 1270,
    "▁range": 1271,
    "▁mencob": 1272,
    "▁mencoba": 1273,
    "akses": 1274,
    "▁luar": 1275,
    "ase": 1276,
    "anjut": 1277,
    "ecursi": 1278,
    "▁dic": 1279,
    "▁diction": 1280,
    "▁dictionary": 1281,
    "▁kos": 1282,
    "▁koso": 1283,
    "▁kosong": 1284,
    "▁key": 1285,
    "▁mengambil": 1286,
    "▁pri": 1287,
    "▁prima": 1288,
    "re": 1289,
    "return": 1290,
    "▁akib": 1291,
    "▁akibat": 1292,
    "▁akibatnya": 1293,
    "▁diperik": 1294,
    "▁diperiksa": 1295,
    "▁ru": 1296,
    "▁ruang": 1297,
    "▁pi": 1298,
    "▁piv": 1299,
    "▁pivot": 1300,
    "▁buruk": 1301,
    "▁selalu": 1302,
    "▁seperti": 1303,
    "▁menya": 1304,
    "▁menyal": 1305,
    "▁menyalin": 1306,
    "▁berubah": 1307,
    "▁memo": 1308,
    "▁memoi": 1309,
    "▁memoiz": 1310,
    "▁memoizati": 1311,
    "▁memoization": 1312,
    "▁cac": 1313,
    "▁cach": 1314,
    "▁cache": 1315,
    "▁long": 1316,
    "▁longest": 1317,
    "▁com": 1318,
    "▁comm": 1319,
    "▁common": 1320,
    "▁subse": 1321,
    "▁subseq": 1322,
    "▁subsequ": 1323,
    "▁subsequen": 1324,
    "▁subsequence": 1325,
    "lcs": 1326,
    "▁coc": 1327,
    "▁cocok": 1328,
    "▁disel": 1329,
    "▁diseles": 1330,
    "▁diselesa": 1331,
    "▁diselesaikan": 1332,
    "▁ciri": 1333,
    "▁op": 1334,
    "▁opti": 1335,
    "▁optimal": 1336,
    "▁substr": 1337,
    "▁substru": 1338,
    "▁substruc": 1339,
    "▁substructur": 1340,
    "▁substructure": 1341,
    "▁dibangun": 1342,
    "▁karak": 1343,
    "▁karakter": 1344,
    "▁selain": 1345,
    "▁komb": 1346,
    "▁kombin": 1347,
    "▁kombinasi": 1348,
    "▁efek": 1349,
    "▁efektif": 1350,
    "▁bahas": 1351,
    "▁bahasa": 1352,
    "▁pemr": 1353,
    "▁pemrogram": 1354,
    "▁pemrograman": 1355,
    "▁real": 1356,
    "▁hingga": 1357,
    "▁perp": 1358,
    "▁perpu": 1359,
    "▁perpust": 1360,
    "▁perpustak": 1361,
    "▁perpustaka": 1362,
    "▁perpustakaan": 1363,
    "▁petu": 1364,
    "▁petug": 1365,
    "▁petugas": 1366,
    "▁bukum": 1367,
    "▁bukumu": 1368,
    "▁penas": 1369,
    "▁penasaran": 1370,
    "▁pinjam": 1371,
    "▁menata": 1372,
    "▁menabung": 1373,
    "▁cel": 1374,
    "▁celengan": 1375,
    "▁ibun": 1376,
    "▁ibunya": 1377,
    "▁tabunganmu": 1378,
    "▁sen": 1379,
    "▁seni": 1380,
    "▁dim": 1381,
    "▁dimiliki": 1382,
    "▁kelo": 1383,
    "▁kelomp": 1384,
    "▁kelompok": 1385,
    "▁sediki": 1386,
    "▁sedikit": 1387,
    "▁daripada": 1388,
    "▁persamaannya": 1389,
    "▁tingg": 1390,
    "▁tinggal": 1391,
    "▁dibag": 1392,
    "▁dibagikan": 1393,
    "▁kepada": 1394,
    "▁tem": 1395,
    "▁temannya": 1396,
    "▁member": 1397,
    "▁memberi": 1398,
    "▁gur": 1399,
    "▁guru": 1400,
    "▁permainan": 1401,
    "▁poin": 1402,
    "▁kebun": 1403,
    "▁sekol": 1404,
    "▁sekolah": 1405,
    "▁mangga": 1406,
    "▁beli": 1407,
    "▁permennya": 1408,
    "▁dibeli": 1409,
    "▁seharga": 1410,
    "▁uangnya": 1411,
    "▁lomb": 1412,
    "▁lomba": 1413,
    "▁lari": 1414,
    "▁edo": 1415,
    "▁berlari": 1416,
    "▁dikalikan": 1417,
    "▁anaknya": 1418,
    "▁merek": 1419,
    "▁mereka": 1420,
    "▁pak": 1421,
    "▁paket": 1422,
    "▁alat": 1423,
    "▁tul": 1424,
    "▁tulis": 1425,
    "▁mur": 1426,
    "▁murah": 1427,
    "▁uangk": 1428,
    "▁uangku": 1429,
    "▁kelilingnya": 1430,
    "▁lebar": 1431,
    "▁buahnya": 1432,
    "▁terisi": 1433,
    "▁harian": 1434,
    "▁disk": 1435,
    "▁diskon": 1436,
    "▁memen": 1437,
    "▁memenuh": 1438,
    "▁memenuhi": 1439,
    "▁berurutan": 1440,
    "▁tengahnya": 1441,
    "▁biaya": 1442,
    "▁selisi": 1443,
    "▁selisih": 1444,
    "▁jumlahnya": 1445,
    "▁memben": 1446,
    "▁membentuk": 1447,
    "▁substitus": 1448,
    "▁substitusikan": 1449,
    "▁mencat": 1450,
    "▁mencatat": 1451,
    "▁memas": 1452,
    "▁memasang": 1453,
    "▁diing": 1454,
    "▁diingin": 1455,
    "▁diinginkan": 1456,
    "▁din": 1457,
    "▁diny": 1458,
    "▁dinyatakan": 1459,
    "▁ekon": 1460,
    "▁ekonom": 1461,
    "▁mengikut": 1462,
    "▁mengikuti": 1463,
    "▁koef": 1464,
    "▁koefisien": 1465,
    "▁kena": 1466,
    "▁kenaikan": 1467,
    "▁masing": 1468,
    "masi": 1469,
    "masing": 1470,
    "▁regresinya": 1471,
    "▁sci": 1472,
    "▁scienti": 1473,
    "▁scientist": 1474,
    "▁multi": 1475,
    "variab": 1476,
    "variable": 1477,
    "▁regres": 1478,
    "▁regressi": 1479,
    "▁regression": 1480,
    "▁datas": 1481,
    "▁dataset": 1482,
    "▁serta": 1483,
    "▁menjumlah": 1484,
    "▁menjumlahkan": 1485,
    "▁inputnya": 1486,
    "▁kerj": 1487,
    "▁kerjanya": 1488,
    "▁melakukan": 1489,
    "▁not": 1490,
    "▁notasi": 1491,
    "▁slic": 1492,
    "▁slicing": 1493,
    "▁amb": 1494,
    "▁ambil": 1495,
    "▁urutannya": 1496,
    "▁bel": 1497,
    "▁belak": 1498,
    "▁belakang": 1499,
    "▁dep": 1500,
    "▁depan": 1501,
    "▁palin": 1502,
    "▁palindr": 1503,
    "▁palindrom": 1504,
    "▁palindrome": 1505,
    "pal": 1506,
    "false": 1507,
    "noh": 1508,
    "noht": 1509,
    "nohty": 1510,
    "nohtyp": 1511,
    "▁coun": 1512,
    "▁count": 1513,
    "even": 1514,
    "▁met": 1515,
    "▁meth": 1516,
    "▁method": 1517,
    "▁sebagai": 1518,
    "▁bukan": 1519,
    "▁terp": 1520,
    "▁terpis": 1521,
    "▁terpisah": 1522,
    "▁alas": 1523,
    "▁alasannya": 1524,
    "▁menukar": 1525,
    "▁sebelah": 1526,
    "▁sebelahnya": 1527,
    "▁bers": 1528,
    "▁bersar": 1529,
    "▁bersarang": 1530,
    "▁operasinya": 1531,
    "▁sebandi": 1532,
    "▁sebanding": 1533,
    "▁kua": 1534,
    "▁kuadr": 1535,
    "▁kuadrat": 1536,
    "▁langkahnya": 1537,
    "▁berp": 1538,
    "▁berpind": 1539,
    "▁berpindah": 1540,
    "▁posisi": 1541,
    "▁paling": 1542,
    "men": 1543,
    "mener": 1544,
    "menerus": 1545,
    "▁sekit": 1546,
    "▁sekitar": 1547,
    "▁mengg": 1548,
    "▁menggabung": 1549,
    "▁menggabungkan": 1550,
    "▁sebanyak": 1551,
    "▁mempr": 1552,
    "▁memproses": 1553,
    "▁diurutkan": 1554,
    "▁as": 1555,
    "▁asc": 1556,
    "▁ascen": 1557,
    "▁ascendi": 1558,
    "▁ascending": 1559,
    "▁dituk": 1560,
    "▁ditukar": 1561,
    "▁tip": 1562,
    "▁tipe": 1563,
    "▁elemennya": 1564,
    "▁iterab": 1565,
    "▁iterable": 1566,
    "▁contohnya": 1567,
    "▁simpulnya": 1568,
    "▁langsungnya": 1569,
    "▁kemu": 1570,
    "▁kemudi": 1571,
    "▁kemudian": 1572,
    "▁dipr": 1573,
    "▁diproses": 1574,
    "▁alf": 1575,
    "▁alfab": 1576,
    "▁alfabe": 1577,
    "▁alfabeti": 1578,
    "▁alfabetis": 1579,
    "▁kunjungannya": 1580,
    "▁mas": 1581,
    "▁masuk": 1582,
    "▁pergi": 1583,
    "▁kemb": 1584,
    "▁kembali": 1585,
    "▁kons": 1586,
    "▁konsep": 1587,
    "▁terdekat": 1588,
    "▁que": 1589,
    "▁queue": 1590,
    "▁mund": 1591,
    "▁mundur": 1592,
    "▁stack": 1593,
    "▁ekspl": 1594,
    "▁eksplor": 1595,
    "▁eksplorasi": 1596,
    "▁komponen": 1597,
    "▁top": 1598,
    "▁topolo": 1599,
    "▁topologi": 1600,
    "▁topologic": 1601,
    "▁topological": 1602,
    "▁id": 1603,
    "▁ide": 1604,
    "▁ideas": 1605,
    "▁back": 1606,
    "▁backt": 1607,
    "▁backtr": 1608,
    "▁backtrack": 1609,
    "▁backtracking": 1610,
    "▁sh": 1611,
    "▁short": 1612,
    "▁shortest": 1613,
    "▁pat": 1614,
    "▁path": 1615,
    "▁dikunjungi": 1616,
    "▁seter": 1617,
    "▁seterusnya": 1618,
    "▁pa": 1619,
    "▁past": 1620,
    "▁pasti": 1621,
    "▁meru": 1622,
    "▁merupa": 1623,
    "▁merupakan": 1624,
    "▁edge": 1625,
    "▁dijk": 1626,
    "▁dijkstr": 1627,
    "▁dijkstra": 1628,
    "▁perhitu": 1629,
    "▁perhitungan": 1630,
    "▁perhitungannya": 1631,
    "▁le": 1632,
    "▁lew": 1633,
    "▁lewat": 1634,
    "▁terbaik": 1635,
    "▁kl": 1636,
    "▁klas": 1637,
    "▁klasik": 1638,
    "▁dijelas": 1639,
    "▁dijelaskan": 1640,
    "▁pendekat": 1641,
    "▁pendekatan": 1642,
    "▁efisien": 1643,
    "▁memanggil": 1644,
    "▁tump": 1645,
    "▁tumpang": 1646,
    "▁tin": 1647,
    "▁tindi": 1648,
    "▁tindih": 1649,
    "▁duplik": 1650,
    "▁duplikat": 1651,
    "▁eksponen": 1652,
    "▁eksponensi": 1653,
    "▁eksponensial": 1654,
    "▁ag": 1655,
    "▁agar": 1656,
    "▁didef": 1657,
    "▁didefin": 1658,
    "▁didefinis": 1659,
    "▁didefinisikan": 1660,
    "▁sebelumnya": 1661,
    "▁punc": 1662,
    "▁puncak": 1663,
    "▁rel": 1664,
    "▁relasi": 1665,
    "▁relasinya": 1666,
    "▁orang": 1667,
    "▁datang": 1668,
    "▁kn": 1669,
    "▁knap": 1670,
    "▁knaps": 1671,
    "▁knapsack": 1672,
    "▁memperti": 1673,
    "▁mempertimb": 1674,
    "▁mempertimbangkan": 1675,
    "▁tas": 1676,
    "▁def": 1677,
    "▁definisi": 1678,
    "▁memungkin": 1679,
    "▁memungkinkan": 1680,
    "▁find": 1681,
    "max": 1682,
    "▁inisi": 1683,
    "▁inisialisasi": 1684,
    "▁bern": 1685,
    "▁bernilai": 1686,
    "▁menginisi": 1687,
    "▁menginisialisasi": 1688,
    "index": 1689,
    "indexerror": 1690,
    "▁len": 1691,
    "▁ekspr": 1692,
    "▁ekspresi": 1693,
    "▁mengakses": 1694,
    "▁bat": 1695,
    "▁batas": 1696,
    "▁rekursif": 1697,
    "▁bermasalah": 1698,
    "▁base": 1699,
    "▁case": 1700,
    "▁dipang": 1701,
    "▁dipanggil": 1702,
    "▁berlanjut": 1703,
    "▁henti": 1704,
    "recursi": 1705,
    "recursion": 1706,
    "recursionerror": 1707,
    "▁kondi": 1708,
    "▁kondisi": 1709,
    "▁das": 1710,
    "▁dasar": 1711,
    "▁menangan": 1712,
    "▁menangani": 1713,
    "▁bila": 1714,
    "▁diperb": 1715,
    "▁diperboleh": 1716,
    "▁diperbolehkan": 1717,
    "ke": 1718,
    "key": 1719,
    "keyerror": 1720,
    "▁melem": 1721,
    "▁melempa": 1722,
    "▁melempar": 1723,
    "prim": 1724,
    "prime": 1725,
    "▁false": 1726,
    "▁masalahnya": 1727,
    "▁berada": 1728,
    "▁hab": 1729,
    "▁habis": 1730,
    "▁kompo": 1731,
    "▁komposit": 1732,
    "▁diangga": 1733,
    "▁dianggap": 1734,
    "▁sehar": 1735,
    "▁seharusnya": 1736,
    "▁dilet": 1737,
    "▁diletak": 1738,
    "▁diletakkan": 1739,
    "▁kem": 1740,
    "▁kemungkin": 1741,
    "▁kemungkinan": 1742,
    "▁lupa": 1743,
    "▁mengurutkan": 1744,
    "▁bergantung": 1745,
    "▁fak": 1746,
    "▁fakta": 1747,
    "▁memut": 1748,
    "▁memutus": 1749,
    "▁memutuskan": 1750,
    "▁berg": 1751,
    "▁berger": 1752,
    "▁bergerak": 1753,
    "▁belum": 1754,
    "▁pemot": 1755,
    "▁pemoto": 1756,
    "▁pemotongan": 1757,
    "▁waktunya": 1758,
    "lo": 1759,
    "log": 1760,
    "▁membuang": 1761,
    "▁tar": 1762,
    "▁targ": 1763,
    "▁target": 1764,
    "▁dibut": 1765,
    "▁dibutuh": 1766,
    "▁dibutuhkan": 1767,
    "▁tum": 1768,
    "▁tumbu": 1769,
    "▁tumbuh": 1770,
    "▁logari": 1771,
    "▁logarit": 1772,
    "▁logaritm": 1773,
    "▁logaritmik": 1774,
    "▁dilanjut": 1775,
    "▁dilanjutkan": 1776,
    "▁ren": 1777,
    "▁rentang": 1778,
    "▁qui": 1779,
    "▁quic": 1780,
    "▁quick": 1781,
    "▁quicks": 1782,
    "▁quicksort": 1783,
    "▁pemilih": 1784,
    "▁pemilihan": 1785,
    "▁perform": 1786,
    "▁performa": 1787,
    "▁menur": 1788,
    "▁menurun": 1789,
    "▁parti": 1790,
    "▁partisi": 1791,
    "▁sei": 1792,
    "▁seimb": 1793,
    "▁seimbang": 1794,
    "▁kedalaman": 1795,
    "▁mengubah": 1796,
    "▁ikut": 1797,
    "▁sali": 1798,
    "▁salin": 1799,
    "▁salinan": 1800,
    "▁diubah": 1801,
    "▁terlih": 1802,
    "▁terlihat": 1803,
    "▁diakses": 1804,
    "▁melalu": 1805,
    "▁melalui": 1806,
    "cop": 1807,
    "copy": 1808,
    "▁memper": 1809,
    "▁memperce": 1810,
    "▁mempercepat": 1811,
    "▁recursi": 1812,
    "▁recursiv": 1813,
    "▁recursive": 1814,
    "▁pern": 1815,
    "▁pernah": 1816,
    "▁munc": 1817,
    "▁muncul": 1818,
    "▁perl": 1819,
    "▁perlu": 1820,
    "▁cuk": 1821,
    "▁cukup": 1822,
    "▁mengh": 1823,
    "▁menghil": 1824,
    "▁menghilangkan": 1825,
    "▁duplika": 1826,
    "▁duplikasi": 1827,
    "▁tingkat": 1828,
    "▁tinggi": 1829,
    "▁interpr": 1830,
    "▁interpret": 1831,
    "▁interpretatif": 1832,
    "▁serb": 1833,
    "▁serbag": 1834,
    "▁serbaguna": 1835,
    "▁sin": 1836,
    "▁sint": 1837,
    "▁sintak": 1838,
    "▁sintaks": 1839,
    "▁mu": 1840,
    "▁mud": 1841,
    "▁mudah": 1842,
    "▁dibaca": 1843,
    "▁mend": 1844,
    "▁menduk": 1845,
    "▁mendukung": 1846,
    "▁berbagai": 1847,
    "▁para": 1848,
    "▁paradi": 1849,
    "▁paradig": 1850,
    "▁paradigma": 1851,
    "▁imp": 1852,
    "▁imper": 1853,
    "▁imperatif": 1854,
    "▁beror": 1855,
    "▁berori": 1856,
    "▁berorien": 1857,
    "▁berorient": 1858,
    "▁berorientasi": 1859,
    "▁fungsion": 1860,
    "▁fungsional": 1861,
    "▁dikemb": 1862,
    "▁dikembangkan": 1863,
    "▁oleh": 1864,
    "▁gui": 1865,
    "▁guid": 1866,
    "▁guido": 1867,
    "▁van": 1868,
    "▁ros": 1869,
    "▁ross": 1870,
    "▁rossum": 1871,
    "▁dir": 1872,
    "▁diril": 1873,
    "▁dirilis": 1874,
    "▁kom": 1875,
    "▁komun": 1876,
    "▁komunit": 1877,
    "▁komunitas": 1878,
    "▁eko": 1879,
    "▁ekosi": 1880,
    "▁ekosist": 1881,
    "▁ekosistem": 1882,
    "▁lib": 1883,
    "▁libr": 1884,
    "▁library": 1885,
    "▁kaya": 1886,
    "▁pengemb": 1887,
    "▁pengembangan": 1888,
    "▁web": 1889,
    "▁anali": 1890,
    "▁analisi": 1891,
    "▁analisis": 1892,
    "▁kecer": 1893,
    "▁kecerdas": 1894,
    "▁kecerdasan": 1895,
    "▁buat": 1896,
    "▁buatan": 1897,
    "▁ot": 1898,
    "▁oto": 1899,
    "▁otomat": 1900,
    "▁otomatis": 1901,
    "▁otomatisasi": 1902
  },
  "merges": [
    [
      "a",
      "n"
    ],
    [
      "e",
      "r"
    ],
    [
      "a",
      "t"
    ],
    [
      "▁",
      "j"
    ],
    [
      "▁",
      "i"
    ],
    [
      "i",
      "k"
    ],
    [
      "▁j",
      "a"
    ],
    [
      "u",
      "t"
    ],
    [
      "m",
      "at"
    ],
    [
      "a",
      "b"
    ],
    [
      "▁ja",
      "w"
    ],
    [
      "▁jaw",
      "ab"
    ],
    [
      "▁i",
      "n"
    ],
    [
      "▁",
      "p"
    ],
    [
      "▁",
      "b"
    ],
    [
      "s",
      "i"
    ],
    [
      "▁p",
      "er"
    ],
    [
      "y",
      "a"
    ],
    [
      "▁b",
      "er"
    ],
    [
      "ik",
      "a"
    ],
    [
      "u",
      "k"
    ],
    [
      "t",
      "an"
    ],
    [
      "▁",
      "mat"
    ],
    [
      "▁mat",
      "e"
    ],
    [
      "▁mate",
      "mat"
    ],
    [
      "▁matemat",
      "ika"
    ],
    [
      "▁per",
      "tan"
    ],
    [
      "▁pertan",
      "ya"
    ],
    [
      "▁pertanya",
      "an"
    ],
    [
      "s",
      "t"
    ],
    [
      "p",
      "ut"
    ],
    [
      "st",
      "r"
    ],
    [
      "▁in",
      "put"
    ],
    [
      "ik",
      "ut"
    ],
    [
      "▁ber",
      "ikut"
    ],
    [
      "▁in",
      "str"
    ],
    [
      "▁instr",
      "uk"
    ],
    [
      "▁instruk",
      "si"
    ],
    [
      "▁jawab",
      "an"
    ],
    [
      "a",
      "l"
    ],
    [
      "▁",
      "a"
    ],
    [
      "a",
      "h"
    ],
    [
      "▁",
      "d"
    ],
    [
      "▁",
      "s"
    ],
    [
      "e",
      "n"
    ],
    [
      "p",
      "a"
    ],
    [
      "a",
      "r"
    ],
    [
      "▁",
      "m"
    ],
    [
      "an",
      "g"
    ],
    [
      "al",
      "ah"
    ],
    [
      "▁a",
      "d"
    ],
    [
      "▁ad",
      "alah"
    ],
    [
      "t",
      "u"
    ],
    [
      "▁",
      "k"
    ],
    [
      "▁",
      "x"
    ],
    [
      "a",
      "m"
    ],
    [
      "▁a",
      "pa"
    ],
    [
      "e",
      "l"
    ],
    [
      "▁i",
      "tu"
    ],
    [
      "n",
      "g"
    ],
    [
      "▁",
      "t"
    ],
    [
      "▁s",
      "e"
    ],
    [
      "i",
      "l"
    ],
    [
      "en",
      "g"
    ],
    [
      "e",
      "m"
    ],
    [
      "ar",
      "i"
    ],
    [
      "k",
      "an"
    ],
    [
      "u",
      "m"
    ],
    [
      "▁",
      "y"
    ],
    [
      "g",
      "i"
    ],
    [
      "▁",
      "l"
    ],
    [
      "u",
      "n"
    ],
    [
      "a",
      "s"
    ],
    [
      "▁d",
      "i"
    ],
    [
      "d",
      "i"
    ],
    [
      "▁",
      "r"
    ],
    [
      "▁per",
      "s"
    ],
    [
      "am",
      "a"
    ],
    [
      "▁s",
      "u"
    ],
    [
      "a",
      "pa"
    ],
    [
      "u",
      "r"
    ],
    [
      "at",
      "a"
    ],
    [
      "▁",
      "h"
    ],
    [
      "g",
      "a"
    ],
    [
      "u",
      "l"
    ],
    [
      "o",
      "l"
    ],
    [
      "▁y",
      "ang"
    ],
    [
      "▁su",
      "d"
    ],
    [
      "▁ber",
      "apa"
    ],
    [
      "um",
      "l"
    ],
    [
      "uml",
      "ah"
    ],
    [
      "▁sud",
      "ut"
    ],
    [
      "n",
      "ya"
    ],
    [
      "al",
      "i"
    ],
    [
      "▁m",
      "en"
    ],
    [
      "eng",
      "an"
    ],
    [
      "▁d",
      "engan"
    ],
    [
      "ang",
      "an"
    ],
    [
      "t",
      "i"
    ],
    [
      "a",
      "k"
    ],
    [
      "▁d",
      "an"
    ],
    [
      "▁k",
      "e"
    ],
    [
      "▁m",
      "em"
    ],
    [
      "▁",
      "si"
    ],
    [
      "▁d",
      "ari"
    ],
    [
      "i",
      "ng"
    ],
    [
      "▁s",
      "o"
    ],
    [
      "el",
      "as"
    ],
    [
      "▁b",
      "il"
    ],
    [
      "▁bil",
      "angan"
    ],
    [
      "▁",
      "n"
    ],
    [
      "▁j",
      "elas"
    ],
    [
      "u",
      "a"
    ],
    [
      "b",
      "u"
    ],
    [
      "▁so",
      "al"
    ],
    [
      "t",
      "uk"
    ],
    [
      "a",
      "gi"
    ],
    [
      "m",
      "p"
    ],
    [
      "▁j",
      "umlah"
    ],
    [
      "ah",
      "an"
    ],
    [
      "e",
      "c"
    ],
    [
      "▁jelas",
      "kan"
    ],
    [
      "▁p",
      "en"
    ],
    [
      "▁si",
      "si"
    ],
    [
      "g",
      "r"
    ],
    [
      "▁ja",
      "di"
    ],
    [
      "a",
      "i"
    ],
    [
      "ol",
      "o"
    ],
    [
      "o",
      "r"
    ],
    [
      "ec",
      "ahan"
    ],
    [
      "▁s",
      "ama"
    ],
    [
      "▁t",
      "er"
    ],
    [
      "▁t",
      "olo"
    ],
    [
      "▁tolo",
      "ng"
    ],
    [
      "▁m",
      "eng"
    ],
    [
      "▁pers",
      "ama"
    ],
    [
      "▁persama",
      "an"
    ],
    [
      "▁pers",
      "e"
    ],
    [
      "▁perse",
      "gi"
    ],
    [
      "u",
      "s"
    ],
    [
      "▁",
      "v"
    ],
    [
      "am",
      "b"
    ],
    [
      "▁k",
      "ali"
    ],
    [
      "a",
      "si"
    ],
    [
      "▁",
      "g"
    ],
    [
      "i",
      "n"
    ],
    [
      "▁p",
      "ecahan"
    ],
    [
      "▁",
      "c"
    ],
    [
      "o",
      "n"
    ],
    [
      "▁h",
      "i"
    ],
    [
      "d",
      "a"
    ],
    [
      "▁j",
      "ika"
    ],
    [
      "e",
      "k"
    ],
    [
      "i",
      "s"
    ],
    [
      "▁t",
      "i"
    ],
    [
      "▁d",
      "ata"
    ],
    [
      "▁p",
      "r"
    ],
    [
      "▁pen",
      "j"
    ],
    [
      "il",
      "ai"
    ],
    [
      "▁n",
      "ilai"
    ],
    [
      "e",
      "s"
    ],
    [
      "ng",
      "an"
    ],
    [
      "▁d",
      "ua"
    ],
    [
      "al",
      "am"
    ],
    [
      "t",
      "er"
    ],
    [
      "▁se",
      "gi"
    ],
    [
      "▁segi",
      "ti"
    ],
    [
      "▁segiti",
      "ga"
    ],
    [
      "gr",
      "am"
    ],
    [
      "▁per",
      "k"
    ],
    [
      "▁perk",
      "ali"
    ],
    [
      "▁perkali",
      "an"
    ],
    [
      "▁se",
      "t"
    ],
    [
      "ik",
      "i"
    ],
    [
      "b",
      "agi"
    ],
    [
      "un",
      "a"
    ],
    [
      "▁penj",
      "umlah"
    ],
    [
      "▁penjumlah",
      "an"
    ],
    [
      "a",
      "j"
    ],
    [
      "il",
      "iki"
    ],
    [
      "amb",
      "ah"
    ],
    [
      "una",
      "kan"
    ],
    [
      "j",
      "a"
    ],
    [
      "▁hi",
      "mp"
    ],
    [
      "▁himp",
      "un"
    ],
    [
      "▁himpun",
      "an"
    ],
    [
      "▁d",
      "alam"
    ],
    [
      "▁p",
      "em"
    ],
    [
      "▁b",
      "en"
    ],
    [
      "▁mem",
      "iliki"
    ],
    [
      "an",
      "di"
    ],
    [
      "e",
      "si"
    ],
    [
      "e",
      "b"
    ],
    [
      "▁",
      "un"
    ],
    [
      "▁un",
      "tuk"
    ],
    [
      "▁",
      "f"
    ],
    [
      "▁pr",
      "o"
    ],
    [
      "b",
      "andi"
    ],
    [
      "▁",
      "o"
    ],
    [
      "p",
      "at"
    ],
    [
      "ik",
      "an"
    ],
    [
      "ari",
      "ab"
    ],
    [
      "▁g",
      "ari"
    ],
    [
      "▁gari",
      "s"
    ],
    [
      "i",
      "h"
    ],
    [
      "u",
      "p"
    ],
    [
      "▁v",
      "ariab"
    ],
    [
      "▁variab",
      "el"
    ],
    [
      "▁k",
      "um"
    ],
    [
      "▁kum",
      "p"
    ],
    [
      "▁kump",
      "ul"
    ],
    [
      "▁kumpul",
      "an"
    ],
    [
      "▁d",
      "er"
    ],
    [
      "▁der",
      "aj"
    ],
    [
      "▁deraj",
      "at"
    ],
    [
      "ang",
      "un"
    ],
    [
      "▁d",
      "at"
    ],
    [
      "▁r",
      "ata"
    ],
    [
      "r",
      "ata"
    ],
    [
      "▁ben",
      "tuk"
    ],
    [
      "ja",
      "di"
    ],
    [
      "▁m",
      "ak"
    ],
    [
      "r",
      "i"
    ],
    [
      "k",
      "ar"
    ],
    [
      "g",
      "unakan"
    ],
    [
      "▁m",
      "is"
    ],
    [
      "▁mis",
      "al"
    ],
    [
      "ar",
      "ga"
    ],
    [
      "▁b",
      "angun"
    ],
    [
      "▁dat",
      "ar"
    ],
    [
      "▁s",
      "k"
    ],
    [
      "▁mak",
      "a"
    ],
    [
      "or",
      "ang"
    ],
    [
      "a",
      "p"
    ],
    [
      "o",
      "d"
    ],
    [
      "▁",
      "an"
    ],
    [
      "▁a",
      "r"
    ],
    [
      "▁se",
      "h"
    ],
    [
      "▁men",
      "jadi"
    ],
    [
      "▁k",
      "ar"
    ],
    [
      "al",
      "a"
    ],
    [
      "▁p",
      "eng"
    ],
    [
      "▁",
      "tan"
    ],
    [
      "an",
      "ya"
    ],
    [
      "▁h",
      "arga"
    ],
    [
      "an",
      "j"
    ],
    [
      "ur",
      "ang"
    ],
    [
      "▁r",
      "e"
    ],
    [
      "▁se",
      "orang"
    ],
    [
      "el",
      "ah"
    ],
    [
      "o",
      "t"
    ],
    [
      "▁r",
      "i"
    ],
    [
      "▁ri",
      "bu"
    ],
    [
      "i",
      "tu"
    ],
    [
      "▁pers",
      "en"
    ],
    [
      "e",
      "f"
    ],
    [
      "▁sk",
      "ala"
    ],
    [
      "▁per",
      "t"
    ],
    [
      "▁",
      "al"
    ],
    [
      "▁misal",
      "kan"
    ],
    [
      "▁set",
      "elah"
    ],
    [
      "u",
      "ng"
    ],
    [
      "anj",
      "ang"
    ],
    [
      "a",
      "da"
    ],
    [
      "ik",
      "u"
    ],
    [
      "s",
      "es"
    ],
    [
      "▁l",
      "ing"
    ],
    [
      "▁ling",
      "kar"
    ],
    [
      "▁lingkar",
      "an"
    ],
    [
      "▁pem",
      "bagi"
    ],
    [
      "▁b",
      "agi"
    ],
    [
      "▁l",
      "i"
    ],
    [
      "▁per",
      "bandi"
    ],
    [
      "▁perbandi",
      "ngan"
    ],
    [
      "▁k",
      "el"
    ],
    [
      "▁se",
      "m"
    ],
    [
      "▁pembagi",
      "an"
    ],
    [
      "en",
      "a"
    ],
    [
      "el",
      "em"
    ],
    [
      "as",
      "alah"
    ],
    [
      "▁kel",
      "il"
    ],
    [
      "▁kelil",
      "ing"
    ],
    [
      "▁se",
      "bu"
    ],
    [
      "▁sebu",
      "ah"
    ],
    [
      "asi",
      "l"
    ],
    [
      "▁kar",
      "ena"
    ],
    [
      "▁ke",
      "d"
    ],
    [
      "elem",
      "en"
    ],
    [
      "▁l",
      "o"
    ],
    [
      "o",
      "h"
    ],
    [
      "▁s",
      "ol"
    ],
    [
      "▁sol",
      "u"
    ],
    [
      "▁solu",
      "si"
    ],
    [
      "u",
      "h"
    ],
    [
      "e",
      "ter"
    ],
    [
      "▁ked",
      "ua"
    ],
    [
      "▁p",
      "ada"
    ],
    [
      "i",
      "si"
    ],
    [
      "▁pro",
      "ses"
    ],
    [
      "eng",
      "ah"
    ],
    [
      "▁al",
      "j"
    ],
    [
      "▁alj",
      "ab"
    ],
    [
      "▁aljab",
      "ar"
    ],
    [
      "ing",
      "ga"
    ],
    [
      "▁r",
      "up"
    ],
    [
      "▁rup",
      "i"
    ],
    [
      "▁rupi",
      "ah"
    ],
    [
      "▁m",
      "od"
    ],
    [
      "▁mod",
      "el"
    ],
    [
      "▁",
      "elemen"
    ],
    [
      "ul",
      "ang"
    ],
    [
      "▁",
      "em"
    ],
    [
      "▁em",
      "pat"
    ],
    [
      "▁r",
      "um"
    ],
    [
      "▁rum",
      "us"
    ],
    [
      "▁l",
      "u"
    ],
    [
      "mp",
      "ul"
    ],
    [
      "▁seh",
      "ingga"
    ],
    [
      "▁su",
      "b"
    ],
    [
      "▁di",
      "a"
    ],
    [
      "▁dia",
      "gram"
    ],
    [
      "▁v",
      "en"
    ],
    [
      "▁ven",
      "n"
    ],
    [
      "▁b",
      "ul"
    ],
    [
      "▁bul",
      "at"
    ],
    [
      "urang",
      "i"
    ],
    [
      "m",
      "al"
    ],
    [
      "▁l",
      "eb"
    ],
    [
      "at",
      "u"
    ],
    [
      "▁re",
      "gr"
    ],
    [
      "▁ber",
      "ulang"
    ],
    [
      "d",
      "ef"
    ],
    [
      "▁ti",
      "t"
    ],
    [
      "▁tit",
      "ik"
    ],
    [
      "anya",
      "k"
    ],
    [
      "al",
      "ikan"
    ],
    [
      "▁",
      "tu"
    ],
    [
      "ul",
      "a"
    ],
    [
      "▁regr",
      "esi"
    ],
    [
      "▁s",
      "er"
    ],
    [
      "▁peng",
      "ur"
    ],
    [
      "▁pengur",
      "angan"
    ],
    [
      "▁d",
      "esi"
    ],
    [
      "▁desi",
      "mal"
    ],
    [
      "a",
      "at"
    ],
    [
      "▁m",
      "asalah"
    ],
    [
      "▁lu",
      "as"
    ],
    [
      "c",
      "i"
    ],
    [
      "▁b",
      "anyak"
    ],
    [
      "▁di",
      "am"
    ],
    [
      "▁diam",
      "eter"
    ],
    [
      "▁h",
      "asil"
    ],
    [
      "▁di",
      "p"
    ],
    [
      "▁s",
      "atu"
    ],
    [
      "ar",
      "a"
    ],
    [
      "▁men",
      "ambah"
    ],
    [
      "▁di",
      "t"
    ],
    [
      "▁t",
      "ot"
    ],
    [
      "▁tot",
      "al"
    ],
    [
      "▁ar",
      "r"
    ],
    [
      "▁an",
      "t"
    ],
